{
    "translator": "Traductor",
    "color_picker": "Selector de colores",
    "converter": "Convertidor",
    "qr_code": "Código QR",
    "settings": "Configuración",
    "service_and_support": "Servicio y soporte",
    "help_center": "Centro de ayuda",
    "order_website": "Ordenar sitio web",
    "project_support": "Soporte de proyectos",
    "others": "Otros",
    "partners": "Socios",
    "reviews": "Reseñas",
    "advertising": "Publicidad",
    "social_media": "Redes sociales",

    "free_online_translator": "Traductor en línea gratuito",
    "translate_file": "Traducir archivo",
    "char_count": "Cantidad de caracteres: ",
    "multilingual_translator": "Traductor multilingüe",
    "multilingual_description": "En esta página, puedes ingresar un texto y traducirlo instantáneamente a 10 idiomas diferentes. Este traductor es una excelente herramienta para quienes desean traducir textos a varios idiomas al mismo tiempo, sin necesidad de traducir cada idioma por separado, facilitando la comprensión inmediata.",
    "placeholder_detect_language": "Detectar idioma",
    "placeholder_enter_text": "Ingrese el texto para traducir...",
    "add_language": "Agregar idioma",
    "translate": "Traducir",
    "translated_text": "Texto traducido",

    "recognize_text": "Reconocer texto en la imagen",
    "translate_text": "Traducir texto",
    "languages_count": "122 idiomas",
    "upload_image": "Subir imagen",
    "supported_formats": "Formatos soportados: Imágenes",
    "photo_translator": "Traductor de fotos",
    "photo_description": "En esta página, puedes cargar imágenes que contienen texto, y nuestro servicio utilizará la tecnología de Reconocimiento Óptico de Caracteres (OCR) para identificar el texto y traducirlo a 10 idiomas diferentes. Es una herramienta excelente para traducir señales, documentos o materiales publicitarios.",
    "translation_error": "Error al traducir.",
    "word_file_error": "Error al leer el archivo Word:",
    "language_detection_failed": "No se pudo detectar el idioma.",
    "ocr_error": "Error al reconocer texto en la imagen:",
    "invalid_file_format": "Formato de archivo inválido. Por favor, suba un archivo DOCX o una imagen.",
    "perform_translation_first": "Por favor, realice primero la traducción.",
    "text_copied": "¡Texto copiado al portapapeles!",

    "define_pixel_color": "Definir color del píxel en la imagen",
    "color_blending": "Mezcla de colores",
    "up_to_10_colors": "Hasta 10 colores",
    "color_picker_result": "Resultado:",
    "select_color_from_image": "Seleccionar color de la imagen",
    "color_picker_description": "En esta página, puedes subir una imagen y usar la función de selección de colores para elegir cualquier color de la imagen. Esta herramienta permite identificar con precisión los valores de color en HEX y RGB. Es perfecta para diseñadores y para aquellos que trabajan con colores.",

    "color_mixer_tool": "Herramienta de mezcla de colores",
    "define_color_by_photo": "Definir color por foto",
    "mixing_result": "Resultado de mezcla:",
    "add_color": "Agregar color",
    "color_mixing_examples": "Ejemplos de mezcla de colores",
    "red": "Rojo",
    "lime": "Lima",
    "blue": "Azul",
    "gray": "Gris",
    "purple": "Púrpura",
    "violet": "Violeta",
    "yellow": "Amarillo",
    "orange": "Naranja",
    "green": "Verde",
    "brown": "Marrón",
    "turquoise": "Turquesa",
    "color_mixer": "Mezclador de colores",
    "color_mixing_description": "En esta página, puedes mezclar diferentes colores y crear nuevos colores. La herramienta 'Mezclador de colores' te permite agregar varios colores, ajustarlos y ver los resultados de la mezcla. Es una herramienta ideal para diseñadores, artistas y cualquier persona que trabaje con colores.",

    "image_converter": "Convertidor de imágenes",
    "image_compression": "Compresión de imágenes",
    "select_image_for_conversion": "Selecciona una imagen para convertir:",
    "select_output_format": "Selecciona el formato de salida",
    "converting": "Convirtiendo...",
    "convert": "Convertir",
    "converted_file": "Archivo convertido:",
    "download_converted_file": "Descargar archivo convertido",
    "image_converters": "Convertidores de imágenes",
    "image_converter_description": "En esta página, puedes convertir imágenes de un formato a otro fácilmente. El convertidor admite formatos como JPEG, PNG, GIF y es ideal para conversiones rápidas de imágenes.",
    "file_too_large": "El archivo es demasiado grande. Por favor, sube un archivo de menos de 10 MB.",
    "please_select_file": "Por favor, selecciona un archivo.",
    "conversion_not_possible": "Conversión no posible.",
    "conversion_error": "Error en la conversión.",

    "select_image_for_compression": "Selecciona una imagen para comprimir:",
    "original_image": "Imagen original:",
    "compressed_image": "Imagen comprimida:",
    "size": "Tamaño:",
    "size_after_compression": "Tamaño después de la compresión:",
    "download_compressed_image": "Descargar imagen comprimida",
    "compress_again": "Comprimir de nuevo",
    "image_size_reduction": "Reducción de tamaño de imagen",
    "image_size_reduction_description": "Esta herramienta reduce el tamaño de las imágenes sin perder calidad. Es perfecta para optimizar imágenes en sitios web y acelerar su tiempo de carga.",

    "qr_code_generator": "Generador de códigos QR",
    "shorten_link": "Acortar enlace",
    "enter_url": "Ingresa tu URL:",
    "scan_to_visit": "Escanea para visitar:",
    "download_qr_code": "Descargar código QR",
    "qr_code_creation": "Creación de código QR",
    "qr_code_creation_description": "En esta página, puedes ingresar cualquier texto o URL para crear un código QR. Este generador de códigos QR es ideal para crear códigos QR para tarjetas de presentación, sitios web o materiales de marketing.",

    "about_us": "Acerca de nosotros",
    "website_description": "Este sitio web fue desarrollado en una semana por dos desarrolladores. Dedicamos todo nuestro tiempo y esfuerzo para ofrecer a los usuarios un servicio práctico y funcional.",
    "specialist_description": "Especialista en la creación de soluciones web creativas y funcionales. Utilización de tecnologías modernas para satisfacer los requisitos de los clientes.",
    "developer_description": "Desarrollador experimentado en la creación de aplicaciones web dinámicas e interactivas. Experto en integración de bases de datos y desarrollo de lógica en el servidor.",
    "pricing_for_website_development": "Precios para desarrollo de sitios web",
    "contact_for_website_development": "Contáctanos para pedir tu sitio web a través de <a href=\"https://t.me/abduvoxit260803\">este enlace</a> y proporciona la información sobre tu proyecto.",
    "pricing_for_templates": "Precios para plantillas de sitios web",

    "shorten_link_online": "Acortar enlace en línea",
    "enter_link": "Introduce el enlace:",
    "shorten": "Acortar",
    "shortened_link": "Enlace acortado:",
    "quick_link_shortening": "Acortamiento rápido de enlaces",
    "description": "En esta página, puedes acortar rápidamente cualquier enlace. Simplemente pega una URL larga en el campo de entrada y obtendrás un enlace corto y ordenado listo para usar. Este servicio es perfecto para simplificar enlaces para redes sociales, campañas de marketing, correos electrónicos o uso personal.",

    "password_generator": "Generador de Contraseñas",
    "50_characters": "50 caracteres",
    "generated_password": "Contraseña generada:",
    "password_length": "Longitud de la contraseña:",
    "include_uppercase": "Incluir letras mayúsculas",
    "include_numbers": "Incluir números",
    "include_symbols": "Incluir símbolos",
    "generate": "Generar",
    "password_generator_online": "Generador de Contraseñas en Línea",
    "generator_description": "En esta página, puede generar rápidamente una contraseña segura. Simplemente configure los parámetros como la longitud de la contraseña y la inclusión de caracteres especiales, y luego haga clic para crear una contraseña única. Este servicio es perfecto para crear contraseñas seguras para varias cuentas y servicios en línea.",

    "card_number_copied": "¡Número de tarjeta copiado!",
    "copy_error": "Error al copiar: ",
    "support_message": "Si desea apoyar nuestro proyecto, puede transferir fondos a una de las siguientes tarjetas:",
    "visa_card": "1. Tarjeta Visa",
    "card_number_label": "Número de tarjeta:",
    "wallet_number_label": "Número de billetera:",
    "thank_you_message": "¡Cualquier apoyo es importante para nosotros. Gracias por tu ayuda!",


    "our_partners": "Nuestros socios",


    "multilingual_page_keywords": "multilingüe, traductor, traductor en 122 idiomas, traductor gratuito, traducción de varios idiomas, traducción multilingüe, traductor en línea, traductor multitarea, traducir varios idiomas, traductor gratuito, traducción en tiempo real, traducciones multilingües, soporte de idiomas, soluciones multilingües, herramienta multilingüe",
    "photo_page_keywords": "traductor de archivos, extracción de texto de archivos, carga y traducción de archivos, traducción de texto desde imágenes, edición del texto traducido, copiar el texto traducido, texto a voz, traducción por voz, traducción de texto desde archivos, traducción OCR de texto, traductor de archivos gratuito, traductor multilingüe de archivos, reconocimiento de texto en imágenes, extracción de texto desde documentos, traducción de documentos, edición y escucha de traducciones",
    "imageSize_page_keywords": "compresión de imágenes, compresión de imágenes gratuita, reducción del tamaño de las imágenes, compresión rápida de imágenes, compresión de imágenes en línea, reducción del tamaño de imágenes, compresión de imágenes sin pérdida, optimización de imágenes, compresión PNG, compresión JPEG, herramienta para reducir el tamaño de imágenes, compresión rápida de imágenes, compresión de imágenes para sitios web, compresión de imágenes para redes sociales, compresor de imágenes gratuito en línea, compresión de imágenes conveniente, optimización rápida de imágenes",
    "image_page_keywords": "convertidor de imágenes, convertidor de imágenes gratuito, convertir imágenes en línea, convertir archivos de imágenes, herramienta para convertir imágenes, convertidor de archivos de imágenes gratuito, convertir PNG a JPG, convertir JPG a PNG, convertir imagen a PDF, conversión de formatos de imágenes, convertidor de imágenes en línea, cambiar el formato de archivos de imágenes, conversión de imágenes conveniente, convertir imágenes gratis, convertidor de imágenes rápido, conversión por lotes de imágenes, convertir fotos en línea",
    "colorPicker_page_keywords": "selector de color, herramienta gratuita para seleccionar color, selector de color en línea, elegir color en línea, selector de color hexadecimal, selector RGB, generador de códigos de color, generador de paletas de colores, herramienta para seleccionar colores, elegir color en línea, rueda de colores, selección de colores, herramienta en línea para seleccionar color, selector de colores para diseño web, selector de colores para diseño gráfico, creación de paletas de colores, creación de colores personalizados, selector de colores gratuito en línea",
    "colorMixing_page_keywords": "mezcla de colores, mezclar colores en línea, mezclador de colores, herramienta para combinar colores, creación de colores personalizados, herramienta para mezclar colores, mezclar colores en línea, mezcla de colores RGB, creación de paletas de colores, mezcla de colores para diseño, mezclador de colores gratuito, mezcla de colores para diseño gráfico, generador de combinaciones de colores, herramienta en línea para mezclar colores, mezcla de colores primarios, armonía de colores, herramienta para mezclar colores, mezcla de colores para diseño web",
    "qrCode_page_keywords": "generador de QR code, crear un QR code en línea, QR code para texto, QR code para enlace, generador de QR code gratuito, generador de QR code para sitios web, creación de QR code, generar QR codes fácilmente, QR code para URL, QR code para mensaje de texto, QR code personalizado, crear QR code para negocios, herramienta para crear QR code, escanear QR code, generador rápido de QR code, generador de QR code en línea, crear QR codes gratis",
    "order_website": "Crear o pedir un sitio web",
    "order_website_description": "Pide un sitio web personalizado o compra plantillas y diseños listos para usar. Desarrollo rápido y asequible de sitios web.",
    "order_website_keywords": "crear un sitio web, pedir un sitio web, comprar plantillas de sitios web, diseño web, desarrollo de sitios web, sitio web personalizado, diseño de sitios web, plantillas HTML, plantillas de sitios web",
    "shortener_page_keywords": "Acortar enlace, Acortamiento rápido de enlaces, Acortar enlaces en línea, Enlaces cortos, Generador de enlaces cortos, Reducir la longitud del enlace, Enlaces cortos para redes sociales, URL corta, Herramienta para acortar enlaces, Acortamiento de enlaces conveniente, Acortamiento de enlaces gratuito",
    "passwordGenerator_page_keywords": "generador de contraseñas, crear contraseña, contraseña segura, generador de contraseñas en línea, generador de contraseñas aleatorias, contraseña con números y símbolos, contraseña con letras mayúsculas, generador de contraseñas para cuentas, contraseña larga, contraseña única, crear una contraseña segura",


    "something_went_wrong": "Algo salió mal",
    "go_back": "Regresar"

}
