{
    "translator": "Çevirmen",
    "color_picker": "Renk Seçici",
    "converter": "Dönüştürücü",
    "qr_code": "QR Kodu",
    "settings": "Ayarlar",
    "service_and_support": "Hizmet ve Destek",
    "help_center": "Yardım Merkezi",
    "order_website": "Web Sitesi Siparişi",
    "project_support": "Proje Desteği",
    "others": "Diğer",
    "partners": "Ortaklar",
    "reviews": "Yorumlar",
    "advertising": "Reklam",
    "social_media": "Sosyal Medya",

    "free_online_translator": "Ücretsiz Çevrimiçi Çevirmen",
    "translate_file": "Dosya Çevir",
    "char_count": "Karakter Sayısı: ",
    "multilingual_translator": "Çok Dilli Çevirmen",
    "multilingual_description": "Bu sayfada metin girerek onu 10 farklı dile anında çevirebilirsiniz. Bu çevirmen, metni aynı anda birden fazla dile çevirmek isteyenler için mükemmel bir araçtır; böylece diller arasında ayrı ayrı işlem yapmaya gerek kalmadan hızlı bir şekilde anlayabilirsiniz.",
    "placeholder_detect_language": "Dili Algıla",
    "placeholder_enter_text": "Çevirmek için metin girin...",

    "recognize_text": "Dosyadan Metin Tanı",
    "translate_text": "Metni Çevir",
    "languages_count": "122 dil",
    "upload_image": "Görsel Yükle",
    "supported_formats": "Desteklenen formatlar: Görseller",
    "photo_translator": "Fotoğraf Çevirmeni",
    "photo_description": "Bu sayfada, üzerinde metin bulunan fotoğrafları yükleyebilir ve hizmetimiz, Optik Karakter Tanıma (OCR) teknolojisi ile metni otomatik olarak tanıyarak 10 farklı dile çevirebilir. Tabelalar, belgeler, reklam materyalleri gibi görsellerden metin çevirmek için ideal bir araçtır.",
    "translation_error": "Çeviri sırasında bir hata oluştu.",
    "word_file_error": "Word dosyası okunurken hata oluştu:",
    "language_detection_failed": "Dil algılanamadı.",
    "ocr_error": "Görselden metin tanıma sırasında hata oluştu:",
    "invalid_file_format": "Geçersiz dosya formatı. Lütfen DOCX dosyası veya görsel yükleyin.",
    "perform_translation_first": "Lütfen önce çeviri yapın.",
    "text_copied": "Metin panoya kopyalandı!",

    "define_pixel_color": "Görseldeki piksel rengini belirleyin",
    "color_blending": "Renk Karıştırma",
    "up_to_10_colors": "10 renge kadar",
    "color_picker_result": "Sonuç:",
    "select_color_from_image": "Görselden renk seç",
    "color_picker_description": "Bu sayfada bir görsel yükleyebilir ve 'Renk Seçici' özelliği ile görselin herhangi bir yerindeki rengi seçebilirsiniz. Bu araç, görseldeki herhangi bir rengin HEX ve RGB formatlarındaki değerlerini tam olarak belirlemenizi sağlar. Tasarımcılar, geliştiriciler ve renklerle çalışan herkes için idealdir.",

    "color_mixer_tool": "Renk Karıştırıcı Aracı",
    "define_color_by_photo": "Fotoğrafla Renk Belirleme",
    "mixing_result": "Karıştırma Sonucu:",
    "add_color": "Renk Ekle",
    "color_mixing_examples": "Renk Karışım Örnekleri",
    "red": "Kırmızı",
    "lime": "Lime",
    "blue": "Mavi",
    "gray": "Gri",
    "purple": "Mor",
    "violet": "Menekşe",
    "yellow": "Sarı",
    "orange": "Turuncu",
    "green": "Yeşil",
    "brown": "Kahverengi",
    "turquoise": "Turkuaz",
    "color_mixer": "Renk Karıştırıcı",
    "color_mixing_description": "Bu sayfada farklı renkleri karıştırarak yeni tonlar oluşturabilirsiniz. 'Renk Karıştırıcı' aracı ile birkaç renk ekleyebilir, renk seçimlerini değiştirebilir ve karışımın sonucunu gerçek zamanlı olarak görebilirsiniz. Kullanıcı dostu arayüzü sayesinde, renkleri HEX formatında düzenleyebilir ve popüler kombinasyonları deneyebilirsiniz. Bu araç, tasarımcılar, sanatçılar ve renklerle çalışan herkes için mükemmel bir çözümdür.",

    "image_converter": "Görsel Dönüştürücü",
    "image_compression": "Görsel Sıkıştırma",
    "select_image_for_conversion": "Dönüştürmek için görsel seçin:",
    "select_output_format": "Çıkış formatını seçin",
    "converting": "Dönüştürülüyor...",
    "convert": "Dönüştür",
    "converted_file": "Dönüştürülen Dosya:",
    "download_converted_file": "Dönüştürülen Dosyayı İndir",
    "image_converters": "Görsel Dönüştürücüler",
    "image_converter_description": "Bu sayfada, görselleri bir formattan diğerine kolayca dönüştürebilirsiniz. Dönüştürücü, JPEG, PNG, GIF gibi popüler formatları destekler ve görselleri hızlı ve kaliteli bir şekilde işlemek için ideal bir araçtır. Bu araç, görselleri web siteleri, sosyal medya ve diğer platformlar için hazırlamak için mükemmeldir.",
    "file_too_large": "Dosya çok büyük. Lütfen en fazla 10 MB boyutunda bir dosya yükleyin.",
    "please_select_file": "Lütfen bir dosya seçin.",
    "conversion_not_possible": "Dönüştürme mümkün değil.",
    "conversion_error": "Dönüştürme sırasında bir hata oluştu.",

    "select_image_for_compression": "Sıkıştırmak için görsel seçin:",
    "original_image": "Orijinal Görsel:",
    "compressed_image": "Sıkıştırılmış Görsel:",
    "size": "Boyut:",
    "size_after_compression": "Sıkıştırmadan sonra boyut:",
    "download_compressed_image": "Sıkıştırılmış Görseli İndir",
    "compress_again": "Tekrar Sıkıştır",
    "image_size_reduction": "Görsel Boyutunu Azaltma",
    "image_size_reduction_description": "Bu araç, kalite kaybı olmadan görselleri sıkıştırarak boyutlarını küçültmenizi sağlar. Bu, web sayfalarının daha hızlı yüklenmesine yardımcı olur. Kullanıcılar, görselleri siteler, uygulamalar ve sosyal medya için optimize edebilir, dosya boyutunu küçültürken yüksek kaliteyi koruyabilir. Görsellerle çalışan web yöneticileri ve tasarımcılar için idealdir.",

    "qr_code_generator": "QR Kod Üretici",
    "shorten_link": "Bağlantıyı Kısalt",
    "enter_url": "URL'nizi girin:",
    "scan_to_visit": "Ziyaret etmek için tarayın:",
    "download_qr_code": "QR Kodunu İndir",
    "qr_code_creation": "QR Kod Oluşturma",
    "qr_code_creation_description": "Bu sayfada, herhangi bir metin veya bağlantıyı girerek hızlı ve kolay bir şekilde QR kodu oluşturabilirsiniz. Üretici, kodu anında günceller ve görsel formatında indirmenizi sağlar. Bu, kartvizitler, web siteleri, promosyonlar veya kişisel ihtiyaçlar için QR kodları oluşturmak için idealdir.",

    "about_us": "Hakkımızda",
    "website_description": "Bu site, iki geliştirici tarafından bir hafta içinde geliştirildi. Kullanıcılarımıza kolay ve işlevsel bir kaynak sunmak için çok zaman ve çaba harcadık.",
    "specialist_description": "Yaratıcı ve işlevsel web çözümleri oluşturma konusunda deneyimli web sitesi geliştirme uzmanı. Modern teknolojilerle çalışarak müşterilerin her türlü ihtiyacını karşılar.",
    "developer_description": "Dinamik ve etkileşimli web uygulamaları geliştirme konusunda geniş deneyime sahip. Projelerin güvenilirliğini ve ölçeklenebilirliğini sağlayarak veritabanı entegrasyonu ve sunucu tarafı mantığı konusunda uzmanlaşmıştır.",
    "pricing_for_website_development": "Web Sitesi Geliştirme Fiyatları",
    "contact_for_website_development": "Bir web sitesi sipariş etmek için <a href=\"https://t.me/abduvoxit260803\">bize ulaşın</a> ve projeniz hakkında bilgi verin. Tüm detayları tartışarak, gereksinimlerinize göre bireysel bir maliyet değerlendirmesi sunarız.",
    "pricing_for_templates": "Web Sitesi Şablon Fiyatları",

    "our_partners": "Ortaklarımız",


    "multilingual_page_keywords": "çok dilli, çevirmen, 122 dilde çevirmen, ücretsiz çevirmen, birden fazla dilde çeviri, çok dilli çeviri, çevrimiçi çevirmen, çok görevli çevirmen, birden fazla dili çevir, ücretsiz çevirmen, gerçek zamanlı çeviri, çok dilli çeviriler, dil desteği, çok dilli çözümler, çok dilli araç",
    "photo_page_keywords": "dosya çevirmeni, dosyalardan metin çıkarma, dosya yükleyip çeviri yapma, resimlerden metin çevirme, çevrilmiş metni düzenleme, çevrilmiş metni kopyalama, metni sese dönüştürme, sesli çeviri, dosyalardan metin çevirisi, OCR metin çevirisi, ücretsiz dosya çevirmeni, çok dilli dosya çevirmeni, resimlerdeki metni tanıma, belgelerden metin çıkarma, belge çevirisi, çevirileri düzenleme ve dinleme",
    "imageSize_page_keywords": "resim sıkıştırma, ücretsiz resim sıkıştırma, resim boyutunu küçültme, hızlı resim sıkıştırma, çevrimiçi resim sıkıştırma, resim boyutunu küçültme, kayıpsız resim sıkıştırma, resim optimizasyonu, PNG sıkıştırma, JPEG sıkıştırma, resim boyutunu küçültme aracı, hızlı resim sıkıştırma, web siteleri için resim sıkıştırma, sosyal medya için resim sıkıştırma, ücretsiz çevrimiçi resim sıkıştırıcı, kolay resim sıkıştırma, hızlı resim optimizasyonu",
    "image_page_keywords": "resim dönüştürücü, ücretsiz resim dönüştürücü, çevrimiçi resim dönüştürücü, resim dosyalarını dönüştürme, resim dönüştürme aracı, ücretsiz resim dosyası dönüştürücü, PNG'yi JPG'ye dönüştürme, JPG'yi PNG'ye dönüştürme, resmi PDF'ye dönüştürme, resim formatları dönüştürme, çevrimiçi resim dönüştürücü, resim dosyası formatını değiştirme, kolay resim dönüştürme, ücretsiz resim dönüştürme, hızlı resim dönüştürücü, toplu resim dönüştürme, çevrimiçi fotoğraf dönüştürme",
    "colorPicker_page_keywords": "renk seçici, ücretsiz renk seçme aracı, çevrimiçi renk seçici, çevrimiçi renk seçme, hex renk seçici, RGB renk seçici, renk kodu oluşturucu, renk paleti oluşturucu, renk seçme aracı, çevrimiçi renk seçme, renk çarkı, renk eşleştirme, çevrimiçi renk seçme aracı, web tasarımı için renk seçici, grafik tasarım için renk seçici, renk paleti oluşturma, özelleştirilmiş renkler oluşturma, ücretsiz çevrimiçi renk seçici",
    "colorMixing_page_keywords": "renk karıştırma, çevrimiçi renk karıştırma, renk karıştırıcı, renkleri birleştirme aracı, özelleştirilmiş renkler oluşturma, renk karıştırma aracı, çevrimiçi renk karıştırma, RGB renk karıştırma, renk paleti oluşturma, tasarım için renk karıştırma, ücretsiz renk karıştırıcı, grafik tasarım için renk karıştırma, renk kombinasyonları oluşturucu, çevrimiçi renk karıştırma aracı, ana renkleri karıştırma, renk uyumu, renk karıştırma aracı, web tasarımı için renk karıştırma",
    "qrCode_page_keywords": "QR kodu oluşturucu, çevrimiçi QR kodu oluşturma, metin için QR kodu, bağlantı için QR kodu, ücretsiz QR kodu oluşturucu, web sitesi için QR kodu oluşturucu, QR kodu oluşturma, QR kodu kolayca oluşturma, URL için QR kodu, metin mesajı için QR kodu, özel QR kodu oluşturma, iş için QR kodu oluşturma, QR kodu oluşturma aracı, QR kodu tarama, hızlı QR kodu oluşturucu, çevrimiçi QR kodu oluşturucu, ücretsiz QR kodu oluşturma",
    "order_website": "Web Sitesi Oluşturma veya Sipariş Etme",
    "order_website_description": "Özel bir web sitesi oluşturun veya hazır şablonlar ve tasarımlar satın alın. Hızlı ve uygun fiyatlı web sitesi geliştirme hizmetleri.",
    "order_website_keywords": "web sitesi oluşturma, web sitesi siparişi, web sitesi şablonları satın alma, web tasarımı, web sitesi geliştirme, özel web sitesi, site tasarımı, HTML şablonları, site şablonları",

    "something_went_wrong": "Bir şeyler yanlış gitti",
    "go_back": "Geri"

}
