{
    "translator": "مترجم",
    "color_picker": "منتقي الألوان",
    "converter": "محول",
    "qr_code": "رمز الاستجابة السريعة",
    "settings": "الإعدادات",
    "service_and_support": "الخدمة والدعم",
    "help_center": "مركز المساعدة",
    "order_website": "طلب موقع إلكتروني",
    "project_support": "دعم المشروع",
    "others": "آخرون",
    "partners": "الشركاء",
    "reviews": "التعليقات",
    "advertising": "الإعلانات",
    "social_media": "وسائل التواصل الاجتماعي",

    "free_online_translator": "مترجم مجاني عبر الإنترنت",
    "translate_file": "ترجمة الملف",
    "char_count": "عدد الأحرف: ",
    "multilingual_translator": "مترجم متعدد اللغات",
    "multilingual_description": "في هذه الصفحة يمكنك إدخال النص وترجمته فورًا إلى 10 لغات مختلفة. هذه الأداة مفيدة للمستخدمين الذين يحتاجون إلى ترجمة متعددة اللغات في نفس الوقت دون الحاجة إلى الترجمة لكل لغة على حدة.",
    "placeholder_detect_language": "كشف اللغة",
    "placeholder_enter_text": "أدخل النص لترجمته...",
    "add_language": "إضافة لغة",
    "translate": "ترجمة",
    "translated_text": "النص المترجم",

    "recognize_text": "التعرف على النص في الصورة",
    "translate_text": "ترجمة النص",
    "languages_count": "122 لغة",
    "upload_image": "رفع صورة",
    "supported_formats": "الصيغ المدعومة: الصور",
    "photo_translator": "مترجم الصور",
    "photo_description": "في هذه الصفحة يمكنك تحميل صورة تحتوي على نصوص. تستخدم خدمتنا تقنية OCR (التعرف الضوئي على الأحرف) لاستخراج النصوص من الصورة وترجمتها إلى 10 لغات مختلفة. إنها الأداة المثالية لترجمة الشعارات أو المستندات أو المواد الدعائية.",
    "translation_error": "خطأ في الترجمة.",
    "word_file_error": "حدث خطأ أثناء قراءة ملف Word:",
    "language_detection_failed": "فشل في اكتشاف اللغة.",
    "ocr_error": "فشل في التعرف على النص في الصورة:",
    "invalid_file_format": "صيغة الملف غير صالحة. يرجى رفع ملفات DOCX أو صورة.",
    "perform_translation_first": "يرجى إجراء الترجمة أولاً.",
    "text_copied": "تم نسخ النص إلى الحافظة!",

    "define_pixel_color": "تعريف لون البكسل في الصورة",
    "color_blending": "دمج الألوان",
    "up_to_10_colors": "حتى 10 ألوان",
    "color_picker_result": "النتيجة:",
    "select_color_from_image": "حدد اللون من الصورة",
    "color_picker_description": "في هذه الصفحة يمكنك رفع صورة واستخدام منتقي الألوان لاختيار أي لون منها. تسمح لك هذه الأداة بتحديد قيمة اللون بدقة باستخدام رموز HEX و RGB. إنها الأداة المثالية للمصممين أو أي شخص يحتاج إلى العمل مع الألوان.",

    "color_mixer_tool": "أداة مزج الألوان",
    "define_color_by_photo": "تعريف اللون بواسطة الصورة",
    "mixing_result": "نتيجة الدمج:",
    "add_color": "أضف لونًا",
    "color_mixing_examples": "أمثلة على مزج الألوان",
    "red": "أحمر",
    "lime": "ليموني",
    "blue": "أزرق",
    "gray": "رمادي",
    "purple": "أرجواني",
    "violet": "بنفسجي",
    "yellow": "أصفر",
    "orange": "برتقالي",
    "green": "أخضر",
    "brown": "بني",
    "turquoise": "تركواز",
    "color_mixer": "مزيج الألوان",
    "color_mixing_description": "في هذه الصفحة يمكنك مزج ألوان مختلفة وإنشاء ألوان جديدة. يتيح لك أداة مزج الألوان إضافة ألوان متعددة وضبطها لمعاينة النتائج. إنها الأداة المثالية للمصممين والفنانين وأي شخص يتعامل مع الألوان.",

    "image_converter": "محول الصور",
    "image_compression": "ضغط الصور",
    "select_image_for_conversion": "حدد الصورة للتحويل:",
    "select_output_format": "حدد الصيغة المطلوبة",
    "converting": "جاري التحويل...",
    "convert": "تحويل",
    "converted_file": "الملف المحول:",
    "download_converted_file": "تنزيل الملف المحول",
    "image_converters": "محولات الصور",
    "image_converter_description": "في هذه الصفحة يمكنك تحويل الصورة من صيغة إلى أخرى. يدعم المحول صيغ JPEG و PNG و GIF وغيرها. إنه أداة مثالية للتحويل السريع للصور.",
    "file_too_large": "الملف كبير جدًا. يرجى رفع ملف أقل من 10 ميغابايت.",
    "please_select_file": "يرجى تحديد ملف.",
    "conversion_not_possible": "لا يمكن التحويل.",
    "conversion_error": "حدث خطأ أثناء التحويل.",

    "select_image_for_compression": "حدد الصورة لضغطها:",
    "original_image": "الصورة الأصلية:",
    "compressed_image": "الصورة المضغوطة:",
    "size": "الحجم:",
    "size_after_compression": "الحجم بعد الضغط:",
    "download_compressed_image": "تنزيل الصورة المضغوطة",
    "compress_again": "إعادة الضغط",
    "image_size_reduction": "تقليل حجم الصورة",
    "image_size_reduction_description": "تتيح لك هذه الأداة تقليل حجم الصورة دون فقدان جودتها. إنها الأداة المثالية لتحسين صور المواقع الإلكترونية وزيادة سرعة التحميل.",

    "qr_code_generator": "مولد رمز الاستجابة السريعة",
    "shorten_link": "تقليص الرابط",
    "enter_url": "أدخل الرابط:",
    "scan_to_visit": "امسح لزيارة:",
    "download_qr_code": "تنزيل رمز الاستجابة السريعة",
    "qr_code_creation": "إنشاء رمز الاستجابة السريعة",
    "qr_code_creation_description": "في هذه الصفحة يمكنك إدخال نص أو رابط لإنشاء رمز استجابة سريعة. مولد رموز الاستجابة السريعة هو الأداة المثالية لإنشاء رموز QR لبطاقات العمل أو المواقع أو المواد الدعائية.",

    "about_us": "معلومات عنا",
    "website_description": "تم إنشاء هذا الموقع بواسطة مطورين في غضون أسبوع واحد. لقد استثمرنا كل وقتنا وجهدنا لإنشاء أداة مفيدة وشاملة للمستخدمين.",
    "specialist_description": "خبراء في حلول تصميم المواقع التي تجمع بين الإبداع والوظائف. نستخدم التقنيات الحديثة لتلبية احتياجات عملائنا.",
    "developer_description": "مطور ذو خبرة في إنشاء التطبيقات التفاعلية والموقع الديناميكي. متخصص في تكامل قواعد البيانات والمنطق الخادم.",
    "pricing_for_website_development": "تسعير تطوير المواقع الإلكترونية",
    "contact_for_website_development": "يرجى الاتصال بنا عبر <a href=\"https://t.me/abduvoxit260803\">هذه الروابط</a> لمناقشة مشروعك وطلب الموقع.",
    "pricing_for_templates": "تسعير القوالب",

    "shorten_link_online": "تقليص الرابط عبر الإنترنت",
    "enter_link": "أدخل الرابط:",
    "shorten": "تقليص",
    "shortened_link": "الرابط المختصر:",
    "quick_link_shortening": "تقليص الروابط بسرعة",
    "description": "في هذه الصفحة، يمكنك تقليص أي رابط بسرعة وسهولة. فقط الصق رابط URL طويل في حقل الإدخال، وستحصل على رابط مختصر وأنيق جاهز للاستخدام. هذه الخدمة مثالية لتبسيط الروابط لوسائل التواصل الاجتماعي، حملات التسويق، رسائل البريد الإلكتروني أو الاستخدام الشخصي.",

    "password_generator": "مولد كلمات المرور",
    "50_characters": "50 حرفًا",
    "generated_password": "كلمة المرور المولدة:",
    "password_length": "طول كلمة المرور:",
    "include_uppercase": "إدراج الحروف الكبيرة",
    "include_numbers": "إدراج الأرقام",
    "include_symbols": "إدراج الرموز",
    "generate": "توليد",
    "password_generator_online": "مولد كلمات المرور عبر الإنترنت",
    "generator_description": "في هذه الصفحة، يمكنك إنشاء كلمة مرور آمنة بسرعة وسهولة. فقط قم بضبط الإعدادات مثل طول كلمة المرور ووجود الرموز الخاصة، ثم اضغط على الزر لإنشاء كلمة مرور فريدة. هذه الخدمة مثالية لإنشاء كلمات مرور آمنة لعدة حسابات وخدمات عبر الإنترنت.",
  
    "card_number_copied": "تم نسخ رقم البطاقة!",
    "copy_error": "خطأ في النسخ: ",
    "support_message": "إذا كنت ترغب في دعم مشروعنا، يمكنك تحويل الأموال إلى إحدى البطاقات التالية:",
    "visa_card": "1. بطاقة فيزا",
    "card_number_label": "رقم البطاقة:",
    "wallet_number_label": "رقم المحفظة:",
    "thank_you_message": "أي دعم مهم بالنسبة لنا. شكراً لمساعدتك!",
  

    "our_partners": "شركاؤنا",


    "multilingual_page_keywords": "مترجم متعدد اللغات, مترجم لـ 122 لغة, مترجم مجاني, ترجمة لغات متعددة, مترجم عبر الإنترنت, مترجم متعدد المهام, ترجمة لغات متعددة, ترجمة مجانية, ترجمة في الوقت الحقيقي, ترجمات متعددة اللغات, دعم لغوي, حلول متعددة اللغات, أداة متعددة اللغات",
    "photo_page_keywords": "مترجم ملفات, استخراج النصوص من الملفات, تحميل وترجمة الملفات, ترجمة النصوص من الصور, تحرير النص المترجم, نسخ النص المترجم, تحويل النص إلى كلام, ترجمة صوتية, ترجمة النصوص من الملفات, ترجمة النصوص باستخدام OCR, مترجم ملفات مجاني, مترجم ملفات متعدد اللغات, التعرف على النصوص في الصور, استخراج النصوص من الوثائق, ترجمة الوثائق, تحرير الاستماع والترجمات",
    "imageSize_page_keywords": "ضغط الصور, ضغط الصور المجاني, تقليل حجم الصور, ضغط الصور السريع, ضغط الصور عبر الإنترنت, تقليل حجم الصور, ضغط الصور بدون فقدان الجودة, تحسين الصور, ضغط PNG, ضغط JPEG, أداة تقليل حجم الصور, ضغط الصور السريع, ضغط الصور للمواقع, ضغط الصور لوسائل التواصل الاجتماعي, ضاغط صور مجاني عبر الإنترنت, ضغط الصور بسهولة, تحسين الصور بسرعة",
    "image_page_keywords": "محول الصور, محول الصور المجاني, تحويل الصور عبر الإنترنت, تحويل ملفات الصور, أداة تحويل الصور, محول ملفات الصور المجاني, تحويل PNG إلى JPG, تحويل JPG إلى PNG, تحويل الصور إلى PDF, تحويل صيغ الصور, محول صور عبر الإنترنت, تغيير صيغة ملفات الصور, تحويل الصور بسهولة, تحويل الصور مجانًا, محول صور سريع, تحويل الصور بالجملة, تحويل الصور عبر الإنترنت",
    "colorPicker_page_keywords": "اختيار الألوان, أداة اختيار الألوان المجانية, اختيار الألوان عبر الإنترنت, اختيار الألوان عبر الإنترنت, أداة اختيار الألوان بنظام Hex, أداة اختيار الألوان بنظام RGB, مولد أكواد الألوان, مولد لوحات الألوان, أداة اختيار الألوان, اختيار الألوان عبر الإنترنت, عجلة الألوان, تنسيق الألوان, أداة اختيار الألوان عبر الإنترنت, أداة اختيار الألوان لتصميم المواقع, أداة اختيار الألوان للتصميم الجرافيكي, إنشاء لوحات الألوان, إنشاء ألوان مخصصة, أداة اختيار الألوان المجانية عبر الإنترنت",
    "colorMixing_page_keywords": "خلط الألوان, خلط الألوان عبر الإنترنت, خلاط الألوان, أداة دمج الألوان, إنشاء ألوان مخصصة, أداة لخلط الألوان, خلط الألوان عبر الإنترنت, خلط الألوان بنظام RGB, إنشاء لوحات الألوان, خلط الألوان للتصميم, خلاط ألوان مجاني, خلط الألوان للتصميم الجرافيكي, مولد مجموعات الألوان, أداة خلط الألوان عبر الإنترنت, خلط الألوان الأساسية, تناغم الألوان, أداة لخلط الألوان, خلط الألوان لتصميم المواقع",
    "qrCode_page_keywords": "مولد QR كود, إنشاء QR كود عبر الإنترنت, QR كود للنص, QR كود للرابط, مولد QR كود مجاني, مولد QR كود للمواقع, إنشاء QR كود, إنشاء QR كود بسهولة, QR كود لعنوان URL, QR كود لرسالة نصية, QR كود مخصص, إنشاء QR كود للأعمال, أداة إنشاء QR كود, مسح QR كود, مولد QR كود سريع, مولد QR كود عبر الإنترنت, إنشاء QR كود مجانًا",
    "order_website": "إنشاء أو طلب موقع",
    "order_website_description": "اطلب موقعًا مخصصًا أو اشترِ قوالب جاهزة وتصميمات. تطوير مواقع سريعة وبأسعار معقولة.",
    "order_website_keywords": "إنشاء موقع, طلب موقع, شراء قوالب مواقع, تصميم مواقع, تطوير المواقع, موقع مخصص, تصميم مواقع, قوالب HTML, قوالب مواقع",
    "shortener_page_keywords": "اختصر الرابط, تقصير الروابط السريع, تقصير الروابط عبر الإنترنت, روابط قصيرة, مولد الروابط القصيرة, تقصير طول الرابط, روابط قصيرة للشبكات الاجتماعية, عنوان URL قصير, أداة تقصير الروابط, تقصير الروابط بسهولة, تقصير الروابط مجانًا",
    "passwordGenerator_page_keywords": "مولد كلمات المرور، إنشاء كلمة مرور، كلمة مرور آمنة، مولد كلمات المرور عبر الإنترنت، مولد كلمات مرور عشوائية، كلمة مرور تحتوي على أرقام ورموز، كلمة مرور تحتوي على حروف كبيرة، مولد كلمة المرور لحسابات، كلمة مرور طويلة، كلمة مرور فريدة، إنشاء كلمة مرور آمنة",


    "something_went_wrong": "حدث خطأ ما",
    "go_back": "الرجوع"

}
