{
    "translator": "Traducteur",
    "color_picker": "Sélecteur de couleur",
    "converter": "Convertisseur",
    "qr_code": "Code QR",
    "settings": "Paramètres",
    "service_and_support": "Service et support",
    "help_center": "Centre d'aide",
    "order_website": "Commande de site web",
    "project_support": "Support de projet",
    "others": "Autres",
    "partners": "Partenaires",
    "reviews": "Avis",
    "advertising": "Publicité",
    "social_media": "Réseaux sociaux",

    "free_online_translator": "Traducteur en ligne gratuit",
    "translate_file": "Traduire un fichier",
    "char_count": "Nombre de caractères: ",
    "multilingual_translator": "Traducteur multilingue",
    "multilingual_description": "Sur cette page, vous pouvez entrer un texte et le traduire instantanément dans 10 langues différentes. Ce traducteur est un excellent outil pour ceux qui veulent traduire des textes dans plusieurs langues à la fois sans avoir besoin de traduire chaque langue séparément, facilitant ainsi la compréhension immédiate.",
    "placeholder_detect_language": "Détecter la langue",
    "placeholder_enter_text": "Entrez du texte à traduire...",

    "recognize_text": "Reconnaître le texte dans l'image",
    "translate_text": "Traduire le texte",
    "languages_count": "122 langues",
    "upload_image": "Télécharger une image",
    "supported_formats": "Formats pris en charge : Images",
    "photo_translator": "Traducteur photo",
    "photo_description": "Sur cette page, vous pouvez télécharger des images contenant du texte, et notre service utilisera la technologie de reconnaissance optique de caractères (OCR) pour identifier le texte et le traduire dans 10 langues différentes. C'est un excellent outil pour traduire des panneaux de signalisation, des documents ou des supports publicitaires.",
    "translation_error": "Erreur lors de la traduction.",
    "word_file_error": "Erreur lors de la lecture du fichier Word :",
    "language_detection_failed": "Impossible de détecter la langue.",
    "ocr_error": "Erreur lors de la reconnaissance du texte dans l'image :",
    "invalid_file_format": "Format de fichier invalide. Veuillez télécharger un fichier DOCX ou une image.",
    "perform_translation_first": "Veuillez d'abord effectuer la traduction.",
    "text_copied": "Texte copié dans le presse-papier!",

    "define_pixel_color": "Définir la couleur du pixel dans l'image",
    "color_blending": "Mélange de couleurs",
    "up_to_10_colors": "Jusqu'à 10 couleurs",
    "color_picker_result": "Résultat :",
    "select_color_from_image": "Sélectionner une couleur à partir de l'image",
    "color_picker_description": "Sur cette page, vous pouvez télécharger une image et utiliser la fonction de sélection de couleur pour choisir n'importe quelle couleur dans l'image. Cet outil permet d'identifier précisément les valeurs de couleur en HEX et RGB. Il est parfait pour les designers et ceux qui travaillent avec les couleurs.",

    "color_mixer_tool": "Outil de mélange de couleurs",
    "define_color_by_photo": "Définir la couleur par photo",
    "mixing_result": "Résultat du mélange :",
    "add_color": "Ajouter une couleur",
    "color_mixing_examples": "Exemples de mélange de couleurs",
    "red": "Rouge",
    "lime": "Citron",
    "blue": "Bleu",
    "gray": "Gris",
    "purple": "Violet",
    "violet": "Violet",
    "yellow": "Jaune",
    "orange": "Orange",
    "green": "Vert",
    "brown": "Marron",
    "turquoise": "Turquoise",
    "color_mixer": "Mélangeur de couleurs",
    "color_mixing_description": "Sur cette page, vous pouvez mélanger différentes couleurs et créer de nouvelles couleurs. L'outil 'Mélangeur de couleurs' vous permet d'ajouter plusieurs couleurs, de les ajuster et de voir les résultats du mélange. C'est un outil idéal pour les designers, artistes et toute personne travaillant avec les couleurs.",

    "image_converter": "Convertisseur d'image",
    "image_compression": "Compression d'image",
    "select_image_for_conversion": "Sélectionnez une image pour la conversion:",
    "select_output_format": "Sélectionnez le format de sortie",
    "converting": "Conversion en cours...",
    "convert": "Convertir",
    "converted_file": "Fichier converti :",
    "download_converted_file": "Télécharger le fichier converti",
    "image_converters": "Convertisseurs d'images",
    "image_converter_description": "Sur cette page, vous pouvez facilement convertir des images d'un format à un autre. Le convertisseur prend en charge des formats comme JPEG, PNG, GIF et est idéal pour une conversion rapide des images.",
    "file_too_large": "Le fichier est trop grand. Veuillez télécharger un fichier de moins de 10 Mo.",
    "please_select_file": "Veuillez sélectionner un fichier.",
    "conversion_not_possible": "Conversion impossible.",
    "conversion_error": "Erreur lors de la conversion.",

    "select_image_for_compression": "Sélectionnez une image pour la compression:",
    "original_image": "Image originale:",
    "compressed_image": "Image compressée:",
    "size": "Taille:",
    "size_after_compression": "Taille après compression:",
    "download_compressed_image": "Télécharger l'image compressée",
    "compress_again": "Compresser à nouveau",
    "image_size_reduction": "Réduction de la taille de l'image",
    "image_size_reduction_description": "Cet outil permet de réduire la taille des images sans perdre de qualité. Il est parfait pour optimiser les images sur les sites web et accélérer leur temps de chargement.",

    "qr_code_generator": "Générateur de code QR",
    "shorten_link": "Raccourcir un lien",
    "enter_url": "Entrez votre URL :",
    "scan_to_visit": "Scannez pour visiter :",
    "download_qr_code": "Télécharger le code QR",
    "qr_code_creation": "Création de code QR",
    "qr_code_creation_description": "Sur cette page, vous pouvez entrer n'importe quel texte ou URL pour créer un code QR. Ce générateur de code QR est idéal pour créer des codes QR pour des cartes de visite, des sites web ou des supports marketing.",

    "about_us": "À propos de nous",
    "website_description": "Ce site a été développé en une semaine par deux développeurs. Nous avons mis tout notre temps et nos efforts pour offrir aux utilisateurs un service pratique et fonctionnel.",
    "specialist_description": "Spécialiste dans la création de solutions web créatives et fonctionnelles. Utilisation des technologies modernes pour répondre aux exigences des clients.",
    "developer_description": "Développeur expérimenté dans la création d'applications web dynamiques et interactives. Expert en intégration de bases de données et en développement de la logique côté serveur.",
    "pricing_for_website_development": "Tarifs pour le développement de sites web",
    "contact_for_website_development": "Contactez-nous pour la commande de site web via <a href=\"https://t.me/abduvoxit260803\">ce lien</a> et fournissez les informations concernant votre projet.",
    "pricing_for_templates": "Tarifs pour les modèles de sites web",

    "shorten_link_online": "Raccourcir le lien en ligne",
    "enter_link": "Entrez le lien :",
    "shorten": "Raccourcir",
    "shortened_link": "Lien raccourci :",
    "quick_link_shortening": "Raccourcissement rapide des liens",
    "description": "Sur cette page, vous pouvez rapidement et facilement raccourcir n'importe quel lien. Il vous suffit de coller une URL longue dans le champ de saisie, et vous obtiendrez un lien court et propre prêt à l'emploi. Ce service est parfait pour simplifier les liens pour les réseaux sociaux, les campagnes marketing, les e-mails ou un usage personnel.",

    "password_generator": "Générateur de Mot de Passe",
    "50_characters": "50 caractères",
    "generated_password": "Mot de passe généré :",
    "password_length": "Longueur du mot de passe :",
    "include_uppercase": "Inclure des lettres majuscules",
    "include_numbers": "Inclure des chiffres",
    "include_symbols": "Inclure des symboles",
    "generate": "Générer",
    "password_generator_online": "Générateur de Mot de Passe en Ligne",
    "generator_description": "Sur cette page, vous pouvez générer rapidement et facilement un mot de passe sécurisé. Il vous suffit de définir des paramètres tels que la longueur du mot de passe et la présence de caractères spéciaux, puis de cliquer pour créer un mot de passe unique. Ce service est idéal pour créer des mots de passe sécurisés pour différents comptes et services en ligne.",
  
    
    "card_number_copied": "Numéro de carte copié!",
    "copy_error": "Erreur lors de la copie: ",
    "support_message": "Si vous souhaitez soutenir notre projet, vous pouvez transférer des fonds sur l'une des cartes suivantes :",
    "visa_card": "1. Carte Visa",
    "card_number_label": "Numéro de carte:",
    "wallet_number_label": "Numéro de portefeuille:",
    "thank_you_message": "Toute aide est importante pour nous. Merci pour votre aide!",


    "our_partners": "Nos partenaires",


    "multilingual_page_keywords": "multilingue, traducteur, traducteur en 122 langues, traducteur gratuit, traduction de plusieurs langues, traduction multilingue, traducteur en ligne, traducteur multitâche, traduire plusieurs langues, traducteur gratuit, traduction en temps réel, traductions multilingues, support linguistique, solutions multilingues, outil multilingue",
    "photo_page_keywords": "traducteur de fichiers, extraction de texte à partir de fichiers, téléchargement et traduction de fichiers, traduction de texte à partir d'images, édition du texte traduit, copier le texte traduit, texte en parole, traduction vocale, traduction de texte depuis des fichiers, OCR traduction de texte, traducteur de fichiers gratuit, traducteur de fichiers multilingue, reconnaissance de texte dans les images, extraction de texte à partir de documents, traduction de documents, édition et écoute des traductions",
    "imageSize_page_keywords": "compression d'images, compression d'images gratuite, réduction de la taille des images, compression rapide d'images, compression d'images en ligne, réduction de la taille des images, compression sans perte d'images, optimisation d'images, compression PNG, compression JPEG, outil de réduction de la taille des images, compression rapide d'images, compression d'images pour les sites web, compression d'images pour les réseaux sociaux, compresseur d'images gratuit en ligne, compression d'images pratique, optimisation rapide des images",
    "image_page_keywords": "convertisseur d'images, convertisseur d'images gratuit, convertir des images en ligne, convertir des fichiers d'images, outil de conversion d'images, convertisseur de fichiers d'images gratuit, convertir PNG en JPG, convertir JPG en PNG, convertir une image en PDF, conversion de formats d'images, convertisseur d'images en ligne, modification du format des fichiers d'images, conversion d'images pratique, convertir des images gratuitement, convertisseur d'images rapide, conversion par lots d'images, convertir des photos en ligne",
    "colorPicker_page_keywords": "sélecteur de couleur, outil gratuit de sélection de couleur, sélecteur de couleur en ligne, choisir une couleur en ligne, sélecteur de couleur hexadécimal, sélecteur RGB, générateur de codes de couleurs, générateur de palettes de couleurs, outil de sélection de couleurs, choisir une couleur en ligne, roue des couleurs, choix des couleurs, outil de sélection de couleurs en ligne, sélecteur de couleurs pour le design web, sélecteur de couleurs pour le design graphique, création de palettes de couleurs, création de couleurs personnalisées, sélecteur de couleurs gratuit en ligne",
    "colorMixing_page_keywords": "mélange de couleurs, mélanger les couleurs en ligne, mélangeur de couleurs, outil de combinaison de couleurs, création de couleurs personnalisées, outil de mélange de couleurs, mélanger les couleurs en ligne, mélange de couleurs RGB, création de palettes de couleurs, mélange de couleurs pour le design, mélangeur de couleurs gratuit, mélange de couleurs pour le design graphique, générateur de combinaisons de couleurs, outil de mélange de couleurs en ligne, mélange de couleurs primaires, harmonie des couleurs, outil de mélange de couleurs, mélange de couleurs pour le design web",
    "qrCode_page_keywords": "générateur de QR code, créer un QR code en ligne, QR code pour texte, QR code pour lien, générateur de QR code gratuit, générateur de QR code pour sites web, création de QR code, générer des QR codes facilement, QR code pour URL, QR code pour message texte, QR code personnalisé, créer un QR code pour les entreprises, outil de création de QR code, scanner un QR code, générateur de QR code rapide, générateur de QR code en ligne, créer des QR codes gratuitement",
    "order_website": "Créer ou commander un site web",
    "order_website_description": "Commandez un site web personnalisé ou achetez des modèles et des maquettes prêts à l'emploi. Développement de sites web rapide et abordable.",
    "order_website_keywords": "créer un site web, commander un site web, acheter des modèles de sites web, web design, développement de site web, site web personnalisé, maquettes de sites web, modèles HTML, modèles de sites web",
    "shortener_page_keywords": "Raccourcir le lien, Raccourcissement rapide des liens, Raccourcissement de lien en ligne, Liens courts, Générateur de liens courts, Réduire la longueur du lien, Liens courts pour les réseaux sociaux, URL courte, Outil de raccourcissement de lien, Raccourcissement de lien pratique, Raccourcissement de lien gratuit",
    "passwordGenerator_page_keywords": "générateur de mot de passe, créer mot de passe, mot de passe sécurisé, générateur de mot de passe en ligne, générateur de mot de passe aléatoire, mot de passe avec chiffres et symboles, mot de passe avec lettres majuscules, générateur de mot de passe pour compte, mot de passe long, mot de passe unique, créer un mot de passe sécurisé",


    "something_went_wrong": "Quelque chose a mal tourné",
    "go_back": "Retour"

}
