{
    "translator": "Translator",
    "color_picker": "Color Picker",
    "converter": "Converter",
    "qr_code": "QR Code",
    "settings": "Settings",
    "service_and_support": "Service & Support",
    "help_center": "Help Center",
    "order_website": "Order a Website",
    "project_support": "Project Support",
    "others": "Others",
    "partners": "Partners",
    "reviews": "Reviews",
    "advertising": "Advertising",
    "social_media": "Social Media",

    "free_online_translator": "Free Online Translator",
    "translate_file": "Translate file",
    "char_count": "Char count: ",
    "multilingual_translator": "Multilingual Translator",
    "multilingual_description": "On this page, you can input text and instantly translate it into 10 different languages. This translator allows you to get translations into multiple languages at once, which is perfect for those who want to quickly understand text in different languages without doing it one at a time.",
    "placeholder_detect_language": "Detect Language",
    "placeholder_enter_text": "Enter text for translation...",

    "recognize_text": "Recognize text from file",
    "translate_text": "Translate text",
    "languages_count": "122 languages",
    "upload_image": "Upload image",
    "supported_formats": "Supported formats: images",
    "photo_translator": "Photo Translator",
    "photo_description": "On this page, you can upload photos with text, and the service will automatically recognize the text using Optical Character Recognition (OCR) technology, and then translate it into 10 different languages. This is the perfect tool for translating text from images such as signs, documents, advertisements, and other visual materials.",

    "define_pixel_color": "Define pixel color on image",
    "color_blending": "Color blending",
    "up_to_10_colors": "Up to 10 colors",
    "color_picker_result": "Result:",
    "select_color_from_image": "Select color from image",
    "color_picker_description": "On this page, you can upload an image and pick any color on it using the 'Color Picker' feature. This handy tool allows you to accurately determine the color anywhere on the image and get its value in HEX and RGB formats. The perfect solution for designers, developers, and anyone who works with colors and needs precise color values from images.",
    "translation_error": "An error occurred during translation.",
    "word_file_error": "Error reading Word file:",
    "language_detection_failed": "Could not determine the language.",
    "ocr_error": "Error recognizing text from the image:",
    "invalid_file_format": "Invalid file format. Please upload a DOCX file or an image.",
    "perform_translation_first": "Please perform the translation first.",
    "text_copied": "Text copied to clipboard!",

    "color_mixer_tool": "Color Mixing Tool",
    "define_color_by_photo": "Define color from photo",
    "mixing_result": "Mixing result:",
    "add_color": "Add color",
    "color_mixing_examples": "Color mixing examples",
    "red": "Red",
    "lime": "Lime",
    "blue": "Blue",
    "gray": "Gray",
    "purple": "Purple",
    "violet": "Violet",
    "yellow": "Yellow",
    "orange": "Orange",
    "green": "Green",
    "brown": "Brown",
    "turquoise": "Turquoise",
    "color_mixer": "Color Mixer",
    "color_mixing_description": "On this page, you can experiment with different colors by mixing them to create new shades. With the 'Color Mixer' tool, you can add multiple colors, adjust them through the color picker, and see the mixing result in real time. The user-friendly interface allows you to work with colors in HEX format and see how different combinations create new shades, including popular mixes. It's the perfect tool for designers, artists, and anyone working with colors to see how various shades mix and blend.",

    "image_converter": "Image Converter",
    "image_compression": "Image Compression",
    "select_image_for_conversion": "Select an image for conversion:",
    "select_output_format": "Select output format",
    "converting": "Converting...",
    "convert": "Convert",
    "converted_file": "Converted file:",
    "download_converted_file": "Download converted file",
    "image_converters": "Photo Converter",
    "image_converter_description": "On this page, you can easily convert images from one format to another. The converter supports popular formats such as JPEG, PNG, GIF, and others, making it an ideal tool for quick and high-quality image processing. This tool will help you prepare images for websites, social media, and other platforms with minimal effort.",
    "file_too_large": "File is too large. Please upload a file not exceeding 10 MB.",
    "please_select_file": "Please select a file.",
    "conversion_not_possible": "Conversion is not possible.",
    "conversion_error": "An error occurred during the conversion.",

    "select_image_for_compression": "Select an image for compression:",
    "original_image": "Original image:",
    "compressed_image": "Compressed image:",
    "size": "Size:",
    "size_after_compression": "Size after compression:",
    "download_compressed_image": "Download compressed image",
    "compress_again": "Compress again",
    "image_size_reduction": "Image Size Reduction",
    "image_size_reduction_description": "This tool allows you to compress images without losing quality, helping to reduce their size and speed up the loading of web pages. Users can quickly optimize images for websites, apps, and social media, maintaining high quality while reducing file sizes. Image compression is perfect for webmasters, designers, and anyone working with large amounts of graphics on the web.",
  
    "qr_code_generator": "QR Code Generator",
    "shorten_link": "Shorten URL",
    "enter_url": "Enter your URL:",
    "scan_to_visit": "Scan to visit:",
    "download_qr_code": "Download QR Code",
    "qr_code_creation": "QR Code Creation",
    "qr_code_creation_description": "On this page, you can quickly and easily create a QR code by entering any text or link. The generator supports instant code updates and allows you to download it as an image. This is perfect for creating QR codes for your business cards, websites, promotions, or personal use.",

    "about_us": "About Us",
    "website_description": "This website was developed by two developers in one week. We dedicated a lot of time and effort to create a user-friendly and functional resource that will help you solve your tasks.",
    "specialist_description": "A website development specialist with experience in creating creative and functional web solutions. Works with modern technologies to meet the client's needs.",
    "developer_description": "Has extensive experience in creating dynamic and interactive web applications. Specializes in database integration and server-side development, ensuring reliability and scalability of projects.",
    "pricing_for_website_development": "Prices for website development",
    "contact_for_website_development": "To order website development, <a href=\"https://t.me/abduvoxit260803\">contact us</a> and tell us about your project. We will discuss all the details and offer an individual price estimate based on your requirements.",
    "pricing_for_templates": "Prices for website templates",

    "shorten_link_online": "Shorten link online",
    "enter_link": "Enter link:",
    "shorten": "Shorten",
    "shortened_link": "Shortened link:",
    "quick_link_shortening": "Quick link shortening",
    "description": "On this page, you can quickly and easily shorten any link. Simply paste a long URL in the input field, and you'll get a short, neat link ready for use. This service is perfect for simplifying links for social media, marketing campaigns, emails, or personal use.",

    "password_generator": "Password Generator",
    "50_characters": "50 characters",
    "generated_password": "Generated Password:",
    "password_length": "Password Length:",
    "include_uppercase": "Include Uppercase Letters",
    "include_numbers": "Include Numbers",
    "include_symbols": "Include Symbols",
    "generate": "Generate",
    "password_generator_online": "Online Password Generator",
    "generator_description": "On this page, you can quickly and easily generate a secure password. Just adjust the settings such as password length and special characters, then click to create a unique password. This service is perfect for creating secure passwords for various accounts and online services.",


    "card_number_copied": "Card number copied!",
    "copy_error": "Error copying: ",
    "support_message": "If you would like to support our project, you can transfer funds to one of the following cards:",
    "visa_card": "1. Visa Card",
    "card_number_label": "Card number:",
    "wallet_number_label": "Wallet number:",
    "thank_you_message": "Any support is important to us. Thank you for your help!",

    "our_partners": "Our Partners",


    "multilingual_page_keywords": "multilingual, translator, 122 language translator, free translator, translate multiple languages, multilingual translation, online translator, multitasking translator, translate several languages, free translation service, real-time translation, multilingual solutions, language support, multilingual tool",
    "photo_page_keywords": "file translator, text extraction from files, upload and translate files, translate text from images, edit translated text, copy translated text, text-to-speech, voice translation, file-based text translation, OCR text translation, free file translator, multilingual file translator, image text recognition, document text extraction, translate document files, edit and listen to translations",
    "imageSize_page_keywords": "image compression, free image compression, reduce image size, compress images quickly, online image compression, image size reduction, lossless image compression, optimize images, image optimization, compress PNG, compress JPEG, image size reduction tool, fast image compression, compress images for websites, image compression for social media, free online image compressor, easy image compression, fast image optimization",
    "image_page_keywords": "image converter, free image converter, convert images online, convert image files, image conversion tool, free image file converter, convert PNG to JPG, convert JPG to PNG, convert image to PDF, image format conversion, online image converter, image file format change, easy image conversion, convert image for free, free online image converter, fast image conversion, convert images in bulk, convert photos online",
    "colorPicker_page_keywords": "color picker, free color picker tool, color picker online, choose color online, hex color picker, RGB color picker, color code generator, color palette generator, color selection tool, pick colors online, color wheel, color matching, online color tool, color picker for web design, color picker for graphic design, color palette creation, create custom colors, free online color picker",
    "colorMixing_page_keywords": "color mixing, mix colors online, color blender, color combination tool, create custom colors, color mixing tool, blend colors online, RGB color mixing, create color palettes, color mixing for design, free color mixer, blend colors for graphic design, color combination generator, online color mixing tool, mixing primary colors, color harmony, color blending tool, color mixing for web design",
    "qrCode_page_keywords": "generate QR code, create QR code online, QR code for text, QR code for link, free QR code generator, QR code generator for websites, QR code maker, generate QR codes easily, QR code for URL, QR code for text message, custom QR code, create QR code for business, QR code creation tool, scan QR code, quick QR code generator, online QR code generator, create QR codes for free",
    "order_website": "Order or Create a Website",
    "order_website_description": "Order a custom website or buy ready-made templates and website layouts. Fast and affordable website development services.",
    "order_website_keywords": "create a website, order a website, buy website templates, website design, website development, custom website, website layouts, HTML templates, website templates",
    "shortener_page_keywords": "Shorten link, Quick link shortening, Online link shortening, Short links, Short link generator, Reduce link length, Short links for social networks, Short URL, Link shortening tool, Convenient link shortening, Free link shortening",
    "passwordGenerator_page_keywords": "password generator, create password, secure password, online password generator, random password generator, password with numbers and symbols, password with uppercase letters, account password generator, long password, unique password, create a secure password",

    "something_went_wrong": "Something went wrong",
    "go_back": "Go back"
}
  