{
    "translator": "Переводчик",
    "color_picker": "Выбор цвета",
    "converter": "Конвертер",
    "qr_code": "QR-код",
    "settings": "Настройки",
    "service_and_support": "Сервис и Поддержка",
    "help_center": "Центр помощи",
    "order_website": "Заказать сайт",
    "project_support": "Поддержка проекта",
    "others": "Другое",
    "partners": "Партнеры",
    "reviews": "Отзывы",
    "advertising": "Реклама",
    "social_media": "Социальные сети",


    "free_online_translator": "Бесплатный онлайн-переводчик",
    "translate_file": "Перевести файл",
    "char_count": "К-во симв: ",
    "multilingual_translator": "Многоязычный переводчик",
    "multilingual_description": "На этой странице вы можете ввести текст и мгновенно перевести его на 10 различных языков. Этот переводчик позволяет получить перевод на несколько языков одновременно, что идеально подходит для тех, кто хочет быстро понять текст на разных языках без необходимости делать это по очереди.",
    "placeholder_detect_language": "Определить язык",
    "placeholder_enter_text": "Введите текст для перевода...",
    "add_language": "Добавить язык",
    "translate": "Перевести",
    "translated_text": "Переведенный текст",
    
    "recognize_text": "Распознать текст с файла",
    "translate_text": "Перевести текст",
    "languages_count": "122 языка",
    "upload_image": "Загрузить изображение",
    "supported_formats": "Поддерживаемые форматы: изображения",
    "photo_translator": "Переводчик по фото",
    "photo_description": "На этой странице можно загружать фотографии с текстом, и сервис автоматически распознает текст с помощью технологии оптического распознавания символов (OCR), а затем переводит его на 10 различных языках. Это идеальный инструмент для перевода текста с изображений, таких как вывески, документы, рекламные материалы и другие визуальные материалы.",
    "translation_error": "Произошла ошибка при переводе.",
    "word_file_error": "Ошибка при чтении Word файла:",
    "language_detection_failed": "Не удалось определить язык.",
    "ocr_error": "Ошибка при распознавании текста с изображения:",
    "invalid_file_format": "Неверный формат файла. Пожалуйста, загрузите файл DOCX или изображение.",
    "perform_translation_first": "Пожалуйста, сначала выполните перевод.",
    "text_copied": "Текст скопирован в буфер обмена!",

    "define_pixel_color": "Определить цвет пикселя на картинке",
    "color_blending": "Смешивания цветов",
    "up_to_10_colors": "до 10 цветов",
    "color_picker_result": "Результат:",
    "select_color_from_image": "Выбор цвета с изображения",
    "color_picker_description": "На этой странице можно загрузить изображение и выбрать на нем любой цвет с помощью функции 'Color Picker'. Этот удобный инструмент позволяет точно определить цвет в любом месте изображения и получить его значение в форматах HEX и RGB. Идеальное решение для дизайнеров, разработчиков и всех, кто работает с цветами и нуждается в точных цветовых значениях с изображений.",

    "color_mixer_tool": "Инструмент для смешивания цветов",
    "define_color_by_photo": "Определить цвет по фото",
    "mixing_result": "Результат смешивания:",
    "add_color": "Добавить цвет",
    "color_mixing_examples": "Примеры смешивания цветов",
    "red": "Красный",
    "lime": "Лаймовый",
    "blue": "Синий",
    "gray": "Серый",
    "purple": "Пурпурный",
    "violet": "Фиолетовый",
    "yellow": "Жолтый",
    "orange": "Оранжевый",
    "green": "Зелёный",
    "brown": "Коричневый",
    "turquoise": "Бирюзовый",
    "color_mixer": "Смешиватель цветов",
    "color_mixing_description": "На этой странице можно экспериментировать с различными цветами, смешивая их для создания новых оттенков. С помощью инструмента \"Color Mixer\" можно добавить несколько цветов, изменять их через выбор цвета и наблюдать результат смешивания в реальном времени. Удобный интерфейс позволяет работать с цветами в формате HEX и видеть, как разные сочетания создают новые оттенки, включая популярные комбинации. Это идеальный инструмент для дизайнеров, художников и всех, кто работает с цветами, чтобы увидеть, как смешиваются и сочетаются различные оттенки.",

    "image_converter": "Конвертер изображений",
    "image_compression": "Сжатие изображений",
    "select_image_for_conversion": "Выберите изображение для конвертации:",
    "select_output_format": "Выберите формат вывода",
    "converting": "Конвертируется...",
    "convert": "Конвертировать",
    "converted_file": "Конвертированный файл:",
    "download_converted_file": "Скачать конвертированный файл",
    "image_converters": "Преобразователь изображений",
    "image_converter_description": "На этой странице можно легко конвертировать изображения из одного формата в другой. Конвертер поддерживает популярные форматы, такие как JPEG, PNG, GIF и другие, что делает его идеальным инструментом для быстрой и качественной обработки изображений. Этот инструмент поможет подготовить изображения для сайтов, социальных сетей и других платформ с минимальными усилиями.",
    "file_too_large": "Файл слишком большой. Пожалуйста, загрузите файл размером не более 10 МБ.",
    "please_select_file": "Пожалуйста, выберите файл.",
    "conversion_not_possible": "Невозможная конвертация.",
    "conversion_error": "Произошла ошибка при конверсии.",

    "select_image_for_compression": "Выберите изображение для сжатия:",
    "original_image": "Исходное изображение:",
    "compressed_image": "Сжато изображение:",
    "size": "Размер:",
    "size_after_compression": "Размер после сжатия:",
    "download_compressed_image": "Скачать сжатое изображение",
    "compress_again": "Сжать еще раз",
    "image_size_reduction": "Уменьшение размера изображений",
    "image_size_reduction_description": "Этот инструмент позволяет сжимать изображения без потери качества, что помогает уменьшить их размер и ускорить загрузку веб-страниц. Пользователи могут быстро оптимизировать изображения для сайтов, приложений и социальных сетей, сохраняя высокое качество при уменьшении объема файлов. Сжатие изображений идеально подходит для веб-мастеров, дизайнеров и всех, кто работает с большим количеством графики в интернете.",

    "qr_code_generator": "Генератор QR-кода",
    "shorten_link": "Сократить ссылку",
    "enter_url": "Введите ваш URL:",
    "scan_to_visit": "Отсканируйте, чтобы посетить:",
    "download_qr_code": "Скачать QR-код",
    "qr_code_creation": "Создание QR-кодов",
    "qr_code_creation_description": "На этой странице вы можете быстро и легко создать QR-код, введя любой текст или ссылку. Генератор поддерживает моментальное обновление кода и позволяет скачать его в формате изображения. Это идеально подходит для создания QR-кодов для ваших визиток, сайтов, акций или личных нужд.",

    "about_us": "О нас",
    "website_description": "Этот сайт был разработан двумя разработчиками за одну неделю. Мы посвятили много времени и усилий, чтобы создать удобный и функциональный ресурс, который поможет вам решить ваши задачи.",
    "specialist_description": "Специалист по разработке сайтов с опытом в создании креативных и функциональных веб-решений. Работает с современными технологиями, чтобы удовлетворить любые нужды клиента.",
    "developer_description": "Имеет богатый опыт в создании динамичных и интерактивных веб-приложений. Специализируется на интеграции с базами данных и разработке серверной логики, обеспечивая надежность и масштабируемость проектов.",
    "pricing_for_website_development": "Цены на разработку сайтов",
    "contact_for_website_development": "Для того чтобы заказать разработку сайта, <a href=\"https://t.me/abduvoxit260803\">свяжитесь с нами</a> и расскажите о вашем проекте. Мы обсудим все детали и предложим индивидуальную оценку стоимости в зависимости от ваших требований.",
    "pricing_for_templates": "Цены на шаблоны сайтов",

    "shorten_link_online": "Сократить ссылку онлайн",
    "enter_link": "Введите ссылку:",
    "shorten": "Сократить",
    "shortened_link": "Короткая ссылка:",
    "quick_link_shortening": "Быстрое сокращение ссылок",
    "description": "На этой странице вы можете быстро и удобно сократить любую ссылку. Просто вставьте длинный URL в поле ввода, и вы получите короткую, аккуратную ссылку, готовую к использованию. Сервис идеально подходит для упрощения ссылок для социальных сетей, маркетинговых кампаний, электронных писем или личного использования.",

    "password_generator": "Генератор Паролей",
    "50_characters": "50 символов",
    "generated_password": "Сгенерированный пароль:",
    "password_length": "Длина пароля:",
    "include_uppercase": "Включить заглавные буквы",
    "include_numbers": "Включить цифры",
    "include_symbols": "Включить символы",
    "generate": "Генерировать",
    "password_generator_online": "Онлайн генератор паролей",
    "generator_description": "На этой странице вы можете быстро и легко сгенерировать надежный пароль. Просто настройте параметры, такие как длина пароля и наличие специальных символов, и нажмите кнопку для создания уникального пароля. Сервис идеально подходит для создания безопасных паролей для различных аккаунтов и онлайн-сервисов.",

    "card_number_copied": "Номер карты скопирован!",
    "copy_error": "Ошибка при копировании: ",
    "support_message": "Если вы хотите поддержать наш проект, вы можете перевести средства на одну из следующих карт:",
    "visa_card": "1. Карта Visa",
    "card_number_label": "Номер карты:",
    "wallet_number_label": "Номер кошелька:",
    "thank_you_message": "Любая поддержка важна для нас. Спасибо за вашу помощь!",

    "our_partners": "Наши Партнеры",



    "multilingual_page_keywords": "многоязычный, переводчик, переводчик на 122 языка, бесплатный переводчик, перевод нескольких языков, многоязычный перевод, онлайн переводчик, многозадачный переводчик, перевести несколько языков, переводчик бесплатно, перевод в реальном времени, многоязычные переводы, языковая поддержка, многоязычные решения, многоязычный инструмент",
    "photo_page_keywords": "переводчик файлов, извлечение текста из файлов, загрузка и перевод файлов, перевод текста с изображений, редактирование переведенного текста, копирование переведенного текста, текст в речь, голосовой перевод, перевод текста из файлов, OCR перевод текста, бесплатный переводчик файлов, многоязычный переводчик файлов, распознавание текста на изображениях, извлечение текста из документов, перевод документов, редактирование и прослушивание переводов",
    "imageSize_page_keywords": "сжатие изображений, бесплатное сжатие изображений, уменьшение размера изображений, быстрое сжатие изображений, онлайн сжатие изображений, уменьшение размера изображений, без потерь сжатие изображений, оптимизация изображений, сжатие PNG, сжатие JPEG, инструмент для уменьшения размера изображений, быстрое сжатие изображений, сжатие изображений для сайтов, сжатие изображений для социальных сетей, бесплатный онлайн компрессор изображений, удобное сжатие изображений, быстрая оптимизация изображений",
    "image_page_keywords": "конвертер изображений, бесплатный конвертер изображений, конвертировать изображения онлайн, конвертировать файлы изображений, инструмент для конвертации изображений, бесплатный конвертер файлов изображений, конвертировать PNG в JPG, конвертировать JPG в PNG, конвертировать изображение в PDF, конвертация форматов изображений, онлайн конвертер изображений, изменение формата файлов изображений, удобная конвертация изображений, конвертировать изображения бесплатно, быстрый конвертер изображений, массовая конвертация изображений, конвертировать фото онлайн",
    "colorPicker_page_keywords": "пикер цветов, бесплатный инструмент для выбора цвета, онлайн пикер цветов, выбрать цвет онлайн, пикер цвета в шестнадцатеричной системе, пикер RGB, генератор цветовых кодов, генератор палитры цветов, инструмент для выбора цветов, выбор цвета онлайн, цветовое колесо, подбор цветов, онлайн инструмент для выбора цвета, пикер цветов для веб-дизайна, пикер цветов для графического дизайна, создание палитры цветов, создание пользовательских цветов, бесплатный онлайн пикер цветов",
    "colorMixing_page_keywords": "смешивание цветов, смешивать цвета онлайн, цветовой блендер, инструмент для комбинирования цветов, создание пользовательских цветов, инструмент для смешивания цветов, смешивать цвета онлайн, смешивание цветов RGB, создание палитры цветов, смешивание цветов для дизайна, бесплатный миксер цветов, смешивание цветов для графического дизайна, генератор цветовых комбинаций, онлайн инструмент для смешивания цветов, смешивание основных цветов, гармония цветов, инструмент для смешивания цветов, смешивание цветов для веб-дизайна",
    "qrCode_page_keywords": "генератор QR кода, создать QR код онлайн, QR код для текста, QR код для ссылки, бесплатный генератор QR кода, генератор QR кода для сайтов, создание QR кода, генерировать QR коды легко, QR код для URL, QR код для текстового сообщения, индивидуальный QR код, создать QR код для бизнеса, инструмент для создания QR кода, сканирование QR кода, быстрый генератор QR кода, онлайн генератор QR кода, создать QR коды бесплатно",
    "order_website": "Создать или заказать сайт",
    "order_website_description": "Закажите индивидуальный сайт или купите готовые шаблоны и верстки. Быстрая и доступная разработка сайтов.",
    "order_website_keywords": "создать сайт, заказать сайт, купить шаблоны сайтов, веб-дизайн, разработка сайта, индивидуальный сайт, верстка сайтов, HTML шаблоны, шаблоны сайтов",
    "shortener_page_keywords": "Сократить ссылку, Быстрое сокращение ссылок, Онлайн сокращение ссылок, Короткие ссылки, Генератор коротких ссылок, Уменьшить длину ссылки, Короткие ссылки для социальных сетей, URL короткий, Инструмент для сокращения ссылок, Удобное сокращение ссылок, Сократить ссылку бесплатно, Бесплатное сокращение ссылок",
    "passwordGenerator_page_keywords": "генератор паролей, создать пароль, надежный пароль, генератор паролей онлайн, безопасный пароль, генератор случайных паролей, пароль с цифрами и символами, пароль с заглавными буквами, генератор паролей для аккаунта, длинный пароль, уникальный пароль, создать безопасный пароль",

    "something_went_wrong": "Что-то пошло не так",
    "go_back": "Назад"
}
  