{
    "translator": "Übersetzer",
    "color_picker": "Farbenwähler",
    "converter": "Konverter",
    "qr_code": "QR-Code",
    "settings": "Einstellungen",
    "service_and_support": "Service und Support",
    "help_center": "Hilfe-Center",
    "order_website": "Website bestellen",
    "project_support": "Projektunterstützung",
    "others": "Andere",
    "partners": "Partner",
    "reviews": "Bewertungen",
    "advertising": "Werbung",
    "social_media": "Soziale Medien",

    "free_online_translator": "Kostenloser Online-Übersetzer",
    "translate_file": "Datei übersetzen",
    "char_count": "Zeichenanzahl: ",
    "multilingual_translator": "Mehrsprachiger Übersetzer",
    "multilingual_description": "Auf dieser Seite können Sie einen Text eingeben und ihn sofort in 10 verschiedene Sprachen übersetzen lassen. Dieser Übersetzer ist ein hervorragendes Werkzeug für diejenigen, die Texte gleichzeitig in mehreren Sprachen übersetzen möchten, ohne jede Sprache einzeln zu übersetzen, was eine sofortige Verständlichkeit ermöglicht.",
    "placeholder_detect_language": "Sprache erkennen",
    "placeholder_enter_text": "Text zum Übersetzen eingeben...",
    "add_language": "Sprache hinzufügen",
    "translate": "Übersetzen",
    "translated_text": "Übersetzter Text",

    "recognize_text": "Text aus dem Bild erkennen",
    "translate_text": "Text übersetzen",
    "languages_count": "122 Sprachen",
    "upload_image": "Bild hochladen",
    "supported_formats": "Unterstützte Formate: Bilder",
    "photo_translator": "Fotoübersetzer",
    "photo_description": "Auf dieser Seite können Sie Bilder hochladen, die Text enthalten. Unser Service verwendet die OCR-Technologie (Optische Zeichenerkennung), um den Text zu erkennen und in 10 verschiedene Sprachen zu übersetzen. Es ist ein großartiges Werkzeug zum Übersetzen von Schildern, Dokumenten oder Werbematerialien.",
    "translation_error": "Fehler bei der Übersetzung.",
    "word_file_error": "Fehler beim Lesen der Word-Datei:",
    "language_detection_failed": "Spracherkennung fehlgeschlagen.",
    "ocr_error": "Fehler bei der Texterkennung im Bild:",
    "invalid_file_format": "Ungültiges Dateiformat. Bitte laden Sie eine DOCX-Datei oder ein Bild hoch.",
    "perform_translation_first": "Bitte führen Sie zuerst die Übersetzung durch.",
    "text_copied": "Text in die Zwischenablage kopiert!",

    "define_pixel_color": "Pixel-Farbe im Bild definieren",
    "color_blending": "Farbmischung",
    "up_to_10_colors": "Bis zu 10 Farben",
    "color_picker_result": "Ergebnis:",
    "select_color_from_image": "Farbe aus dem Bild auswählen",
    "color_picker_description": "Auf dieser Seite können Sie ein Bild hochladen und die Farbwahl verwenden, um jede Farbe im Bild auszuwählen. Dieses Tool ermöglicht es, die Farben genau in HEX und RGB zu bestimmen. Es ist ideal für Designer und alle, die mit Farben arbeiten.",

    "color_mixer_tool": "Farbenmischwerkzeug",
    "define_color_by_photo": "Farbe nach Foto definieren",
    "mixing_result": "Mischergebnis:",
    "add_color": "Farbe hinzufügen",
    "color_mixing_examples": "Beispiele für Farbenmischung",
    "red": "Rot",
    "lime": "Lime",
    "blue": "Blau",
    "gray": "Grau",
    "purple": "Lila",
    "violet": "Violett",
    "yellow": "Gelb",
    "orange": "Orange",
    "green": "Grün",
    "brown": "Braun",
    "turquoise": "Türkis",
    "color_mixer": "Farbenmischer",
    "color_mixing_description": "Auf dieser Seite können Sie verschiedene Farben mischen und neue Farben erstellen. Das 'Farbenmischwerkzeug' ermöglicht es Ihnen, mehrere Farben hinzuzufügen, anzupassen und das Ergebnis der Mischung zu sehen. Es ist ein ideales Werkzeug für Designer, Künstler und alle, die mit Farben arbeiten.",

    "image_converter": "Bildkonverter",
    "image_compression": "Bildkompression",
    "select_image_for_conversion": "Bild zum Konvertieren auswählen:",
    "select_output_format": "Ausgabeformat auswählen",
    "converting": "Konvertiere...",
    "convert": "Konvertieren",
    "converted_file": "Konvertierte Datei:",
    "download_converted_file": "Konvertierte Datei herunterladen",
    "image_converters": "Bildkonverter",
    "image_converter_description": "Auf dieser Seite können Sie Bilder von einem Format in ein anderes konvertieren. Der Konverter unterstützt Formate wie JPEG, PNG, GIF und ist ideal für schnelle Bildkonvertierungen.",
    "file_too_large": "Die Datei ist zu groß. Bitte laden Sie eine Datei mit weniger als 10 MB hoch.",
    "please_select_file": "Bitte wählen Sie eine Datei aus.",
    "conversion_not_possible": "Konvertierung nicht möglich.",
    "conversion_error": "Fehler bei der Konvertierung.",

    "select_image_for_compression": "Bild zum Komprimieren auswählen:",
    "original_image": "Originalbild:",
    "compressed_image": "Komprimiertes Bild:",
    "size": "Größe:",
    "size_after_compression": "Größe nach der Komprimierung:",
    "download_compressed_image": "Komprimiertes Bild herunterladen",
    "compress_again": "Erneut komprimieren",
    "image_size_reduction": "Bildgrößenreduzierung",
    "image_size_reduction_description": "Dieses Tool reduziert die Bildgröße, ohne die Qualität zu verlieren. Es ist perfekt, um Bilder für Websites zu optimieren und die Ladegeschwindigkeit zu erhöhen.",

    "qr_code_generator": "QR-Code Generator",
    "shorten_link": "Link kürzen",
    "enter_url": "URL eingeben:",
    "scan_to_visit": "Scannen, um zu besuchen:",
    "download_qr_code": "QR-Code herunterladen",
    "qr_code_creation": "QR-Code-Erstellung",
    "qr_code_creation_description": "Auf dieser Seite können Sie beliebigen Text oder eine URL eingeben, um einen QR-Code zu erstellen. Dieser QR-Code-Generator ist ideal für die Erstellung von QR-Codes für Visitenkarten, Websites oder Werbematerialien.",

    "about_us": "Über uns",
    "website_description": "Diese Website wurde innerhalb einer Woche von zwei Entwicklern erstellt. Wir haben unsere ganze Zeit und Energie investiert, um den Benutzern einen praktischen und funktionalen Service anzubieten.",
    "specialist_description": "Spezialist für die Erstellung kreativer und funktionaler Weblösungen. Verwendung moderner Technologien, um die Anforderungen der Kunden zu erfüllen.",
    "developer_description": "Erfahrener Entwickler bei der Erstellung dynamischer und interaktiver Webanwendungen. Experte in der Integration von Datenbanken und Serverlogik.",
    "pricing_for_website_development": "Preise für Website-Entwicklung",
    "contact_for_website_development": "Kontaktieren Sie uns, um Ihre Website über <a href=\"https://t.me/abduvoxit260803\">diesen Link</a> zu bestellen und uns Informationen über Ihr Projekt zu geben.",
    "pricing_for_templates": "Preise für Website-Vorlagen",

    "shorten_link_online": "Link online kürzen",
    "enter_link": "Link eingeben:",
    "shorten": "Kürzen",
    "shortened_link": "Gekürzter Link:",
    "quick_link_shortening": "Schnelles Linkkürzen",
    "description": "Auf dieser Seite können Sie schnell und einfach einen beliebigen Link kürzen. Fügen Sie einfach eine lange URL in das Eingabefeld ein, und Sie erhalten einen kurzen, übersichtlichen Link, der zur Verwendung bereit ist. Dieser Dienst eignet sich perfekt, um Links für soziale Medien, Marketingkampagnen, E-Mails oder den persönlichen Gebrauch zu vereinfachen.",

    "password_generator": "Passwort Generator",
    "50_characters": "50 Zeichen",
    "generated_password": "Generiertes Passwort:",
    "password_length": "Passwortlänge:",
    "include_uppercase": "Großbuchstaben einbeziehen",
    "include_numbers": "Zahlen einbeziehen",
    "include_symbols": "Symbole einbeziehen",
    "generate": "Generieren",
    "password_generator_online": "Online Passwort Generator",
    "generator_description": "Auf dieser Seite können Sie schnell und einfach ein sicheres Passwort generieren. Passen Sie einfach die Einstellungen wie Passwortlänge und Sonderzeichen an und klicken Sie auf die Schaltfläche, um ein einzigartiges Passwort zu erstellen. Dieser Dienst ist perfekt für die Erstellung sicherer Passwörter für verschiedene Konten und Online-Dienste.",
  
    "card_number_copied": "Kartennummer kopiert!",
    "copy_error": "Fehler beim Kopieren: ",
    "support_message": "Wenn Sie unser Projekt unterstützen möchten, können Sie Gelder auf eine der folgenden Karten überweisen:",
    "visa_card": "1. Visa Karte",
    "card_number_label": "Kartennummer:",
    "wallet_number_label": "Wallet-Nummer:",
    "thank_you_message": "Jede Unterstützung ist für uns wichtig. Vielen Dank für Ihre Hilfe!",
  

    "our_partners": "Unsere Partner",

    "name": "Name",
    "review": "Bewertung",
    "submit_review": "Bewertung absenden",
    "attention": "Achtung!",
    "review_deletion_available": "Bewertungen können gelöscht werden.",
    "all_reviews": "Alle Bewertungen:",
    "loading_reviews": "Bewertungen werden geladen...",
    "delete": "Löschen",
    "review_deleted_successfully": "Bewertung erfolgreich gelöscht!",
    "review_submitted_successfully": "Ihre Bewertung wurde erfolgreich gesendet!",
    "one_message_per_hour": "Sie können nur eine Nachricht pro Stunde senden. Bitte versuchen Sie es später noch einmal.",
    "review_submission_error": "Fehler beim Absenden der Bewertung. Bitte versuchen Sie es erneut.",
    "enter_your_name": "Geben Sie Ihren Namen ein",
    "enter_your_review": "Geben Sie Ihre Bewertung ein",


    "multilingual_page_keywords": "mehrsprachig, Übersetzer, Übersetzer für 122 Sprachen, kostenloser Übersetzer, Übersetzung mehrerer Sprachen, mehrsprachige Übersetzung, Online-Übersetzer, Multitasking-Übersetzer, mehrere Sprachen übersetzen, kostenloser Übersetzer, Übersetzung in Echtzeit, mehrsprachige Übersetzungen, Sprachunterstützung, mehrsprachige Lösungen, mehrsprachiges Tool",
    "photo_page_keywords": "Dateiübersetzer, Textextraktion aus Dateien, Datei hochladen und übersetzen, Text von Bildern übersetzen, übersetzten Text bearbeiten, übersetzten Text kopieren, Text in Sprache, Sprachübersetzung, Text aus Dateien übersetzen, OCR-Textübersetzung, kostenloser Dateiübersetzer, mehrsprachiger Dateiübersetzer, Texterkennung in Bildern, Textextraktion aus Dokumenten, Dokumente übersetzen, Übersetzungen bearbeiten und anhören",
    "imageSize_page_keywords": "Bildkomprimierung, kostenlose Bildkomprimierung, Bildgrößenreduktion, schnelle Bildkomprimierung, Online-Bildkomprimierung, Bildgrößenreduzierung, verlustfreie Bildkomprimierung, Bildoptimierung, PNG-Komprimierung, JPEG-Komprimierung, Werkzeug zur Bildgrößenreduktion, schnelle Bildkomprimierung, Bildkomprimierung für Websites, Bildkomprimierung für soziale Netzwerke, kostenloser Online-Bildkompressor, bequeme Bildkomprimierung, schnelle Bildoptimierung",
    "image_page_keywords": "Bildkonverter, kostenloser Bildkonverter, Bilder online konvertieren, Bilddateien konvertieren, Werkzeug zum Konvertieren von Bildern, kostenloser Bilddateikonverter, PNG in JPG konvertieren, JPG in PNG konvertieren, Bild in PDF konvertieren, Bildformat-Konvertierung, Online-Bildkonverter, Bilddateiformat ändern, bequeme Bildkonvertierung, Bilder kostenlos konvertieren, schneller Bildkonverter, Massenkonvertierung von Bildern, Fotos online konvertieren",
    "colorPicker_page_keywords": "Farbauswahl, kostenloses Farbauswahl-Tool, Online-Farbauswahl, Farbe online auswählen, Hexadezimal-Farbauswahl, RGB-Farbauswahl, Farbcodes-Generator, Farbpaletten-Generator, Farbauswahl-Tool, Farbe online wählen, Farbkreis, Farbauswahl, Online-Tool zur Farbauswahl, Farbauswahl für Webdesign, Farbauswahl für Grafikdesign, Farbpaletten erstellen, benutzerdefinierte Farben erstellen, kostenloses Online-Farbwähler-Tool",
    "colorMixing_page_keywords": "Farben mischen, Farben online mischen, Farb-Mixer, Werkzeug zum Kombinieren von Farben, benutzerdefinierte Farben erstellen, Werkzeug zum Mischen von Farben, Farben online mischen, RGB-Farben mischen, Farbpaletten erstellen, Farben für Design mischen, kostenloser Farbmixer, Farben für Grafikdesign mischen, Farbkombinationen Generator, Online-Tool zum Mischen von Farben, Grundfarben mischen, Farb-Harmonie, Tool zum Mischen von Farben, Farben für Webdesign mischen",
    "qrCode_page_keywords": "QR-Code-Generator, QR-Code online erstellen, QR-Code für Text, QR-Code für Link, kostenloser QR-Code-Generator, QR-Code-Generator für Websites, QR-Code erstellen, QR-Codes einfach generieren, QR-Code für URL, QR-Code für Textnachricht, individueller QR-Code, QR-Code für Geschäft erstellen, QR-Code-Tool, QR-Code scannen, schneller QR-Code-Generator, Online-QR-Code-Generator, QR-Codes kostenlos erstellen",
    "order_website": "Website erstellen oder bestellen",
    "order_website_description": "Bestellen Sie eine maßgeschneiderte Website oder kaufen Sie vorgefertigte Vorlagen und Designs. Schnelle und erschwingliche Website-Entwicklung.",
    "order_website_keywords": "Website erstellen, Website bestellen, Website-Vorlagen kaufen, Webdesign, Website-Entwicklung, maßgeschneiderte Website, Website-Layouts, HTML-Vorlagen, Website-Vorlagen",
    "shortener_page_keywords": "Link kürzen, Schnelles Linkkürzen, Online-Linkkürzen, Kurze Links, Kurzlink-Generator, Linklänge reduzieren, Kurze Links für soziale Netzwerke, Kurze URL, Linkkürzungs-Tool, Bequemes Linkkürzen, Kostenloses Linkkürzen",
    "passwordGenerator_page_keywords": "Passwort Generator, Passwort erstellen, sicheres Passwort, Online Passwort Generator, zufälliger Passwort Generator, Passwort mit Zahlen und Symbolen, Passwort mit Großbuchstaben, Passwort Generator für Konten, langes Passwort, einzigartiges Passwort, sicheres Passwort erstellen",


    "something_went_wrong": "Etwas ist schiefgelaufen",
    "go_back": "Zurück"

}
