{
    "translator": "Tarjimon",
    "color_picker": "Rang tanlash",
    "converter": "Konvertor",
    "qr_code": "QR-kod",
    "settings": "Sozlamalar",
    "service_and_support": "Xizmat va Qo'llab-quvvatlash",
    "help_center": "Yordam markazi",
    "order_website": "Veb-sayt buyurtma qilish",
    "project_support": "Loyihaga yordam",
    "others": "Boshqalar",
    "partners": "Hamkorlar",
    "reviews": "Sharhlar",
    "advertising": "Reklama",
    "social_media": "Ijtimoiy tarmoqlar",

    "free_online_translator": "Bepul onlayn tarjimon",
    "translate_file": "Faylni tarjima qilish",
    "char_count": "Belgilar soni: ",
    "multilingual_translator": "Ko'p tilli tarjimon",
    "multilingual_description": "Bu sahifada siz matnni kiriting va uni 10 ta turli tilda tezkor tarjima qiling. Ushbu tarjimon bir vaqtning o'zida bir nechta tillarga tarjima qilish imkonini beradi, bu matnni turli tillarda tushunishni tezlashtiradi va qulay qiladi.",
    "placeholder_detect_language": "Tilni aniqlash",
    "placeholder_enter_text": "Tarjima uchun matnni kiriting...",
    "add_language": "Til qo‘shish",
    "translate": "Tarjima qilish",
    "translated_text": "Tarjima qilingan matn",

    "recognize_text": "Fayldan matnni aniqlash",
    "translate_text": "Matnni tarjima qilish",
    "languages_count": "122 til",
    "upload_image": "Rasm yuklash",
    "supported_formats": "Qo'llab-quvvatlanadigan formatlar: rasmlar",
    "photo_translator": "Foto tarjimon",
    "photo_description": "Ushbu sahifada fotosuratlarni yuklab, ulardagi matnni optik belgi aniqlash (OCR) texnologiyasi yordamida avtomatik ravishda aniqlash va 10 ta tilga tarjima qilish imkonini beradi. Bu vosita reklama materiallari, hujjatlar va boshqa vizual materiallardagi matnni tarjima qilish uchun ideal.",
    "translation_error": "Tarjima jarayonida xatolik yuz berdi.",
    "word_file_error": "Word faylini o'qishda xatolik yuz berdi:",
    "language_detection_failed": "Tilni aniqlab bo'lmadi.",
    "ocr_error": "Rasmdagi matnni aniqlashda xatolik yuz berdi:",
    "invalid_file_format": "Fayl formati noto‘g‘ri. Iltimos, DOCX yoki rasm faylini yuklang.",
    "perform_translation_first": "Iltimos, avval tarjimani bajaring.",
    "text_copied": "Matn clipboardga nusxalandi!",

    "define_pixel_color": "Rasmdagi piksel rangini aniqlash",
    "color_blending": "Ranglarni aralashtirish",
    "up_to_10_colors": "10 tagacha rang",
    "color_picker_result": "Natija:",
    "select_color_from_image": "Rasmdan rang tanlash",
    "color_picker_description": "Ushbu sahifada rasmni yuklab, 'Color Picker' funksiyasi yordamida istalgan joyidan rang tanlash imkoniyatiga ega bo'lasiz. Ushbu qulay vosita rasmdagi istalgan joyning HEX va RGB formatlaridagi rangini aniqlashga yordam beradi. Dizaynerlar, ishlab chiquvchilar va ranglar bilan ishlayotgan har bir kishi uchun ideal yechim.",

    "color_mixer_tool": "Ranglarni aralashtirish vositasi",
    "define_color_by_photo": "Rangni foto orqali aniqlash",
    "mixing_result": "Aralashtirish natijasi:",
    "add_color": "Rang qo'shish",
    "color_mixing_examples": "Ranglarni aralashtirish misollari",
    "red": "Qizil",
    "lime": "Layn",
    "blue": "Ko‘k",
    "gray": "Kulrang",
    "purple": "Binafsha",
    "violet": "Siyohrang",
    "yellow": "Sariq",
    "orange": "To‘q sariq",
    "green": "Yashil",
    "brown": "Jigarrang",
    "turquoise": "Moviy yashil",
    "color_mixer": "Ranglarni aralashtiruvchi",
    "color_mixing_description": "Ushbu sahifada turli ranglarni aralashtirib, yangi ohanglar yaratishingiz mumkin. 'Color Mixer' vositasi yordamida bir nechta rang qo'shish, ularni sozlash va real vaqt rejimida natijalarni ko'rish imkoniyatiga ega bo'lasiz. Bu dizaynerlar va san'at bilan shug'ullanadiganlar uchun rang kombinatsiyalarini sinab ko'rish va moslashtirish uchun ideal vosita.",

    "image_converter": "Rasm konvertori",
    "image_compression": "Rasmlarni siqish",
    "select_image_for_conversion": "Konvertatsiya uchun rasmni tanlang:",
    "select_output_format": "Chiqish formatini tanlang",
    "converting": "Konvertatsiya qilinmoqda...",
    "convert": "Konvertatsiya qilish",
    "converted_file": "Konvertatsiya qilingan fayl:",
    "download_converted_file": "Konvertatsiya qilingan faylni yuklab olish",
    "image_converters": "Rasm konvertorlari",
    "image_converter_description": "Bu sahifada rasmni bir formatdan boshqasiga oson va tez konvertatsiya qilishingiz mumkin. Konvertor JPEG, PNG, GIF va boshqa mashhur formatlarni qo'llab-quvvatlaydi, bu esa rasmlarni tez va sifatli qayta ishlashga imkon beradi.",
    "file_too_large": "Fayl juda katta. Iltimos, hajmi 10 MB dan oshmagan fayl yuklang.",
    "please_select_file": "Iltimos, faylni tanlang.",
    "conversion_not_possible": "Konvertatsiya qilishning iloji yo'q.",
    "conversion_error": "Konvertatsiya qilishda xatolik yuz berdi.",

    "select_image_for_compression": "Siqish uchun rasmni tanlang:",
    "original_image": "Asl rasm:",
    "compressed_image": "Siqilgan rasm:",
    "size": "Hajm:",
    "size_after_compression": "Siqilganidan keyin hajmi:",
    "download_compressed_image": "Siqilgan rasmni yuklab olish",
    "compress_again": "Yana siqish",
    "image_size_reduction": "Rasmlarni hajmini kamaytirish",
    "image_size_reduction_description": "Ushbu vosita rasmlarni sifatni yo'qotmagan holda siqishga yordam beradi, bu esa ularning hajmini kamaytirib, veb-sahifalarni tez yuklashga imkon beradi. Bu vosita veb-sayt egalari, dizaynerlar va grafikalar bilan ishlaydiganlar uchun juda mos keladi.",

    "qr_code_generator": "QR-kod generatori",
    "shorten_link": "Havolani qisqartirish",
    "enter_url": "URL manzilini kiriting:",
    "scan_to_visit": "Tashrif buyurish uchun skanerlang:",
    "download_qr_code": "QR-kodni yuklab olish",
    "qr_code_creation": "QR-kodlarni yaratish",
    "qr_code_creation_description": "Bu sahifada har qanday matn yoki havolani kiritib, QR-kod yaratishingiz mumkin. Generator kodni tez yangilaydi va rasm formatida yuklab olish imkonini beradi.",

    "about_us": "Biz haqimizda",
    "website_description": "Ushbu sayt ikki dasturchi tomonidan bir hafta ichida ishlab chiqilgan. Biz saytni qulay va funksional qilish uchun ko'p vaqt va mehnat sarfladik.",
    "specialist_description": "Saytlarni ishlab chiqish bo'yicha mutaxassis. Yaratilgan kreativ va funksional veb-yechimlar bilan mijozlar ehtiyojlarini qondirish uchun ishlaydi.",
    "developer_description": "Dinamik va interaktiv veb-ilovalarni yaratishda katta tajribaga ega dasturchi.",
    "pricing_for_website_development": "Saytlarni yaratish narxlari",
    "contact_for_website_development": "Sayt yaratishni buyurtma qilish uchun <a href=\"https://t.me/abduvoxit260803\">biz bilan bog'laning</a> va loyiha haqida ma'lumot bering. Talablaringizga qarab narxlar baholanadi.",
    "pricing_for_templates": "Sayt shablonlari narxlari",

    "shorten_link_online": "Havolani qisqartirish onlayn",
    "enter_link": "Havolani kiriting:",
    "shorten": "Qisqartirish",
    "shortened_link": "Qisqartirilgan havola:",
    "quick_link_shortening": "Tezkor havola qisqartirish",
    "description": "Ushbu sahifada siz har qanday havolani tez va oson qisqartirishingiz mumkin. Uzun URLni kirish maydoniga joylashtiring va qisqa, toza havolani oling, foydalanishga tayyor. Ushbu xizmat ijtimoiy tarmoqlar, marketing kampaniyalari, elektron pochta yoki shaxsiy foydalanish uchun havolalarni soddalashtirish uchun juda mos keladi.",

    "password_generator": "Parol Generatori",
    "50_characters": "50 belgilar",
    "generated_password": "Yaratilgan parol:",
    "password_length": "Parol uzunligi:",
    "include_uppercase": "Katta harflar qo'shish",
    "include_numbers": "Raqamlarni qo'shish",
    "include_symbols": "Simvollarni qo'shish",
    "generate": "Yaratish",
    "password_generator_online": "Online parol generatori",
    "generator_description": "Ushbu sahifada siz tez va oson tarzda xavfsiz parol yaratishingiz mumkin. Faqatgina parol uzunligi va maxsus simvollarni qo'shish parametrlarini sozlang, so'ngra noyob parol yaratish uchun tugmani bosing. Xizmat turli hisoblar va onlayn xizmatlar uchun xavfsiz parollar yaratishda juda mos keladi.",

    "card_number_copied": "Karta raqami nusxalandi!",
    "copy_error": "Nusxalashda xato: ",
    "support_message": "Agar siz loyihamizni qo'llab-quvvatlamoqchi bo'lsangiz, quyidagi kartalardan biriga mablag' o'tkazishingiz mumkin:",
    "visa_card": "1. Visa karta",
    "card_number_label": "Karta raqami:",
    "wallet_number_label": "Hamyon raqami:",
    "thank_you_message": "Har qanday yordam biz uchun muhim. Yordamingiz uchun rahmat!",


    "our_partners": "Hamkorlarimiz",

    "name": "Ism",
    "review": "Fikr",
    "submit_review": "Fikrni yuborish",
    "attention": "Diqqat!",
    "review_deletion_available": "Fikrlarni o'chirish mumkin.",
    "all_reviews": "Barcha fikrlar:",
    "loading_reviews": "Fikrlar yuklanmoqda...",
    "delete": "O'chirish",
    "review_deleted_successfully": "Fikr muvaffaqiyatli o'chirildi!",
    "review_submitted_successfully": "Sizning fikringiz muvaffaqiyatli yuborildi!",
    "one_message_per_hour": "Siz bir soatda faqat birta xabar yuborishingiz mumkin. Iltimos, keyinroq qayta urinib ko'ring.",
    "review_submission_error": "Fikrni yuborishda xatolik yuz berdi. Iltimos, yana bir bor urinib ko'ring.",
    "enter_your_name": "Ismingizni kiriting",
    "enter_your_review": "Fikringizni kiriting",


    "multilingual_page_keywords": "ko'p tilli, tarjimon, 122 tilda tarjimon, bepul tarjimon, bir nechta tilda tarjima, ko'p tilli tarjima, onlayn tarjimon, ko'p vazifali tarjimon, bir nechta tildagi tarjima, bepul tarjimon, real vaqt tarjimasi, ko'p tilli tarjimalar, tilni qo'llab-quvvatlash, ko'p tilli echimlar, ko'p tilli vosita",
    "photo_page_keywords": "fayllar tarjimoni, fayllardan matnni ajratib olish, fayllarni yuklab tarjima qilish, tasvirdan matnni tarjima qilish, tarjima qilingan matnni tahrirlash, tarjima qilingan matnni nusxalash, matnni ovozga aylantirish, ovozli tarjima, fayllardan matnni tarjima qilish, OCR matnni tarjima qilish, bepul fayl tarjimoni, ko'p tilli fayl tarjimoni, tasvordagi matnni tanish, hujjatlarni tarjima qilish, tarjimalarni tahrirlash va tinglash",
    "imageSize_page_keywords": "rasmlarni siqish, bepul rasm siqish, rasm hajmini kamaytirish, tez rasm siqish, onlayn rasm siqish, rasm hajmini kichraytirish, yo'qotishlarsiz rasm siqish, rasmni optimallashtirish, PNG siqish, JPEG siqish, rasm hajmini kamaytirish vositasi, tez rasm siqish, saytlar uchun rasm siqish, ijtimoiy tarmoqlar uchun rasm siqish, bepul onlayn rasm siqish, qulay rasm siqish, tez rasm optimallashtirish",
    "image_page_keywords": "rasm konvertatori, bepul rasm konvertatori, onlayn rasm konvertatori, rasm fayllarini konvertatsiya qilish, rasm konvertatsiyasi vositasi, bepul rasm fayl konvertatori, PNG ni JPG ga o'zgartirish, JPG ni PNG ga o'zgartirish, rasmni PDF ga o'zgartirish, rasm formatlarini o'zgartirish, onlayn rasm konvertatori, rasm fayllari formatini o'zgartirish, qulay rasm konvertatsiyasi, bepul rasm konvertatsiyasi, tezkor rasm konvertatori, ommaviy rasm konvertatsiyasi, onlayn fotosurat konvertatsiyasi",
    "colorPicker_page_keywords": "rang tanlovchisi, bepul rang tanlash vositasi, onlayn rang tanlash vositasi, onlayn rangni tanlash, rang tanlash hex tizimi, RGB rang tanlash, rang kodlarini yaratish, rang palitrasi generatori, ranglarni tanlash vositasi, onlayn rang tanlash, rang g'ildiragi, ranglarni tanlash, ranglar moslamasi, ranglar generatori, grafika dizayni uchun rang tanlash, veb dizayni uchun rang tanlash, bepul onlayn rang tanlash vositasi",
    "colorMixing_page_keywords": "ranglarni aralashtirish, ranglarni onlayn aralashtirish, rang blenderi, ranglarni birlashtirish vositasi, foydalanuvchi ranglarini yaratish, rang aralashtirish vositasi, ranglarni onlayn aralashtirish, RGB ranglarini aralashtirish, rang palitrasini yaratish, dizayn uchun ranglarni aralashtirish, bepul rang mikseri, grafik dizayn uchun ranglarni aralashtirish, rang kombinatsiyalarini yaratish, ranglar aralashuvi generatori, ranglarni aralashtirish vositasi, veb dizayni uchun ranglarni aralashtirish",
    "qrCode_page_keywords": "QR kod generatori, onlayn QR kod yaratish, matn uchun QR kod, havola uchun QR kod, bepul QR kod generatori, veb-saytlar uchun QR kod generatori, QR kod yaratish, QR kodlarni oson yaratish, URL uchun QR kod, matnli xabar uchun QR kod, maxsus QR kod yaratish, biznes uchun QR kod yaratish, QR kod yaratish vositasi, QR kodni skaner qilish, tezkor QR kod generatori, onlayn QR kod generatori, bepul QR kod yaratish",
    "order_website": "Veb-sayt yaratish yoki buyurtma berish",
    "order_website_description": "Maxsus veb-sayt yarating yoki tayyor shablonlar va dizaynlarni sotib oling. Tez va arzon veb-sayt ishlab chiqish xizmatlari.",
    "order_website_keywords": "sayt yaratish, sayt buyurtma berish, sayt shablonlarini sotib olish, veb-dizayn, sayt ishlab chiqish, maxsus sayt, sayt dizayni, HTML shablonlar, sayt shablonlari",
    "shortener_page_keywords": "Havolani qisqartirish, Tezkor havolalarni qisqartirish, Onlayn havolalarni qisqartirish, Qisqa havolalar, Qisqa havola yaratish, Havola uzunligini qisqartirish, Ijtimoiy tarmoqlar uchun qisqa havolalar, Qisqa URL, Havolalarni qisqartirish asbobi, Qulay havolalarni qisqartirish, Havolalarni bepul qisqartirish, silkani qisqartirish, online qisqartirish",
    "passwordGenerator_page_keywords": "parol generatori, parol yaratish, xavfsiz parol, online parol generatori, tasodifiy parol generatori, raqamlar va simvollar bilan parol, katta harflar bilan parol, akkaunt parol generatori, uzun parol, noyob parol, xavfsiz parol yaratish",


    "something_went_wrong": "Biror narsa noto'g'ri ketdi",
    "go_back": "Orqaga"

}
