{
    "translator": "Котормочу",
    "color_picker": "Түс тандоо",
    "converter": "Конвертер",
    "qr_code": "QR коду",
    "settings": "Орнотуулар",
    "service_and_support": "Кызмат жана колдоо",
    "help_center": "Жардам борбору",
    "order_website": "Веб-сайт буйрутмасы",
    "project_support": "Долбоорго колдоо",
    "others": "Башкалар",
    "partners": "Өнөктөштөр",
    "reviews": "Пикирлер",
    "advertising": "Жарнама",
    "social_media": "Социалдык тармактар",

    "free_online_translator": "Акысыз онлайн котормочу",
    "translate_file": "Файлды которуу",
    "char_count": "Белгинин саны: ",
    "multilingual_translator": "Көп тилдүү котормочу",
    "multilingual_description": "Бул бетте текстти киргизип, аны 10 башка тилге ошол замат которсоңуз болот. Бул котормочу текстти бир нече тилге бир убакта которгусу келгендер үчүн эң сонун курал, тилдерди өзүнчө которуу зарылдыгы жок эле, текстти дароо түшүнүүгө жардам берет.",
    "placeholder_detect_language": "Тилди аныктоо",
    "placeholder_enter_text": "Которуу үчүн текст киргизиңиз...",

    "recognize_text": "Файлдан текстти таануу",
    "translate_text": "Текстти которуу",
    "languages_count": "122 тил",
    "upload_image": "Сүрөт жүктөө",
    "supported_formats": "Колдоого алынган форматтар: Сүрөттөр",
    "photo_translator": "Сүрөт котормочу",
    "photo_description": "Бул бетте текст камтылган сүрөттөрдү жүктөп, биздин кызмат автоматтык түрдө текстти Оптикалык Символдорду Таануу (OCR) технологиясы аркылуу таанып, 10 башка тилге которот. Бул курал жол белгилерин, документтерди жана жарнамалык материалдарды которуу үчүн идеалдуу.",
    "translation_error": "Котормо учурунда ката кетти.",
    "word_file_error": "Word файлын окуу учурунда ката кетти:",
    "language_detection_failed": "Тилди аныктоо мүмкүн болгон жок.",
    "ocr_error": "Сүрөттөн текстти таануу учурунда ката кетти:",
    "invalid_file_format": "Жараксыз файл форматы. DOCX файлын же сүрөттү жүктөңүз.",
    "perform_translation_first": "Сураныч, адегенде котормо жүргүзүңүз.",
    "text_copied": "Текст тактага көчүрүлдү!",

    "define_pixel_color": "Сүрөттөгү пикселдин түсүн аныктоо",
    "color_blending": "Түстөрдү аралаштыруу",
    "up_to_10_colors": "10 түс кошууга болот",
    "color_picker_result": "Жыйынтык:",
    "select_color_from_image": "Сүрөттөн түс тандоо",
    "color_picker_description": "Бул бетте сүрөттү жүктөп, 'Түс тандоо' функциясын колдонуп, сүрөттүн каалаган жериндеги түстү тандасаңыз болот. Бул курал сүрөттөгү түстөрдүн HEX жана RGB форматтарындагы маанилерин так аныктоого жардам берет. Бул дизайнерлер жана түстөр менен иштегендер үчүн мыкты курал.",

    "color_mixer_tool": "Түс аралаштыргыч куралы",
    "define_color_by_photo": "Сүрөт менен түстү аныктоо",
    "mixing_result": "Аралаштыруунун жыйынтыгы:",
    "add_color": "Түс кошуу",
    "color_mixing_examples": "Түс аралаштыруу мисалдары",
    "red": "Кызыл",
    "lime": "Лайм",
    "blue": "Көк",
    "gray": "Боз",
    "purple": "Күлгүн",
    "violet": "Кызгылт көк",
    "yellow": "Сары",
    "orange": "Кызгылт сары",
    "green": "Жашыл",
    "brown": "Күрөң",
    "turquoise": "Көк-жашыл",
    "color_mixer": "Түс аралаштыргыч",
    "color_mixing_description": "Бул бетте ар кандай түстөрдү аралаштырып, жаңы түстөрдү жарата аласыз. 'Түс аралаштыргыч' куралы бир нече түстү кошууга, аларды өзгөртүүгө жана аралаштыруунун жыйынтыгын көрүүгө мүмкүнчүлүк берет. Бул курал дизайнерлер, сүрөтчүлөр жана түстөр менен иштегендер үчүн идеалдуу.",

    "image_converter": "Сүрөт конвертери",
    "image_compression": "Сүрөттүн өлчөмүн кичирейтүү",
    "select_image_for_conversion": "Конверттөө үчүн сүрөт тандаңыз:",
    "select_output_format": "Чыгуу форматты тандаңыз",
    "converting": "Конверттөө жүрүп жатат...",
    "convert": "Конверттөө",
    "converted_file": "Конверттелген файл:",
    "download_converted_file": "Конверттелген файлды жүктөө",
    "image_converters": "Сүрөт конвертерлери",
    "image_converter_description": "Бул бетте сүрөттөрдү бир форматтан экинчисине оңой которууга болот. Конвертер JPEG, PNG, GIF сыяктуу форматтарды колдойт жана сүрөттөрдү тез иштетүү үчүн идеалдуу курал болуп саналат.",
    "file_too_large": "Файл өтө чоң. 10 МБдан ашпаган файлды жүктөңүз.",
    "please_select_file": "Файл тандаңыз.",
    "conversion_not_possible": "Конверттөө мүмкүн эмес.",
    "conversion_error": "Конверттөө учурунда ката кетти.",

    "select_image_for_compression": "Кичирейтүү үчүн сүрөт тандаңыз:",
    "original_image": "Баштапкы сүрөт:",
    "compressed_image": "Кичирейтилген сүрөт:",
    "size": "Өлчөмү:",
    "size_after_compression": "Кичирейтилгенден кийинки өлчөмү:",
    "download_compressed_image": "Кичирейтилген сүрөттү жүктөө",
    "compress_again": "Кайра кичирейтүү",
    "image_size_reduction": "Сүрөттүн өлчөмүн кичирейтүү",
    "image_size_reduction_description": "Бул курал сүрөттөрдү сапатын жоготпой кичирейтүүгө мүмкүндүк берет. Бул веб-баракчаларды тез жүктөөгө жардам берет жана сүрөттөрдү оптимизациялоодо маанилүү курал болуп саналат.",

    "qr_code_generator": "QR код түзүүчү",
    "shorten_link": "Шилтемени кыскартуу",
    "enter_url": "URL дарегиңизди киргизиңиз:",
    "scan_to_visit": "Баруу үчүн сканерлеңиз:",
    "download_qr_code": "QR кодун жүктөө",
    "qr_code_creation": "QR код түзүү",
    "qr_code_creation_description": "Бул бетте каалаган текстти же шилтемени киргизип, QR кодун жаратсаңыз болот. Бул курал визиткалар, веб-сайттар жана жарнамалык максаттар үчүн QR кодун түзүү үчүн идеалдуу.",

    "about_us": "Биз жөнүндө",
    "website_description": "Бул сайт эки иштеп чыгуучу тарабынан бир жуманын ичинде иштелип чыккан. Колдонуучуларга ыңгайлуу жана иштөөчү ресурс берүү үчүн көп убакыт жана күч жумшалган.",
    "specialist_description": "Жаратман жана функционалдуу веб-чечимдерди түзүү боюнча тажрыйбалуу адис. Кардарлардын каалаган талабын аткаруу үчүн заманбап технологияларды колдонот.",
    "developer_description": "Динамикалык жана интерактивдүү веб-тиркемелерди иштеп чыгуу боюнча тажрыйбалуу. Маалыматтар базасын интеграциялоо жана сервердик логиканы иштеп чыгуу боюнча адис.",
    "pricing_for_website_development": "Веб-сайт иштеп чыгуу баалары",
    "contact_for_website_development": "Веб-сайт буйрутмалоо үчүн <a href=\"https://t.me/abduvoxit260803\">бизге кайрылыңыз</a> жана долбооруңуз тууралуу маалымат бериңиз.",
    "pricing_for_templates": "Веб-сайт шаблондорунун баалары",

    "shorten_link_online": "Онлайн шилтемени кыскартуу",
    "enter_link": "Шилтемени киргизиңиз:",
    "shorten": "Кыскартуу",
    "shortened_link": "Кыскартылган шилтеме:",
    "quick_link_shortening": "Тез шилтеме кыскартуу",
    "description": "Бул бетте сиз шилтемени тез жана оңой кыскарта аласыз. Узун URLди киргизүү талаасына куюп, кыска, таза шилтемени аласыз, пайдаланууга даяр. Бул кызмат социалдык медиа, маркетинг кампаниялары, электрондук почта же жеке колдонуу үчүн шилтемелерди жөнөкөйлөтүү үчүн абдан ылайыктуу.",

    "password_generator": "Пароль Генератору",
    "50_characters": "50 белгиден",
    "generated_password": "Жаратылган пароль:",
    "password_length": "Пароль узундугу:",
    "include_uppercase": "Чоң тамгаларды кошуу",
    "include_numbers": "Сандардын кошуу",
    "include_symbols": "Белгилерди кошуу",
    "generate": "Жаратуу",
    "password_generator_online": "Онлайн пароль генератору",
    "generator_description": "Бул баракта сиз коопсуз паролду ыкчам жана оңой жарата аласыз. Паролдун узундугу жана атайын символдор сыяктуу параметрлерди жөндөп, уникалдуу пароль түзүү үчүн баскычты басыңыз. Бул кызмат ар кандай эсептер жана онлайн кызматтар үчүн коопсуз паролдорду түзүү үчүн идеалдуу.",

    "card_number_copied": "Карта номери көчүрүлдү!",
    "copy_error": "Көчүрүүдө ката: ",
    "support_message": "Эгерде биздин долбоорду колдоп келсеңиз, төмөнкү карталардын бирине акча которо аласыз:",
    "visa_card": "1. Visa карта",
    "card_number_label": "Карта номери:",
    "wallet_number_label": "Кошелек номери:",
    "thank_you_message": "Ар кандай колдоо биз үчүн маанилүү. Жардамыңыз үчүн рахмат!",


    "our_partners": "Биздин өнөктөштөр",


    "multilingual_page_keywords": "көп тилдүү, котормочу, 122 тилде котормочу, акысыз котормочу, бир нече тилде котормо, көп тилдүү котормо, онлайн котормочу, көп тапшырмалуу котормочу, бир нече тилди которуу, акысыз котормочу, реалдуу убакытта котормо, көп тилдүү котормолор, тилдик колдоо, көп тилдүү чечимдер, көп тилдүү курал",
    "photo_page_keywords": "файл котормочусу, файлдардан текстти чыгарып алуу, файлдарды жүктөп котормо жасоо, сүрөттөрдөн текст котормо, которулган текстти түзөтүү, которулган текстти көчүрүү, текстти үнгө айландыруу, үн менен котормо, файлдардан текст котормо, OCR текст котормо, акысыз файл котормочусу, көп тилдүү файл котормочусу, сүрөттөрдөгү текстти таануу, документтерден текстти чыгарып алуу, документтерди которуу, котормолорду түзөтүү жана угуу",
    "imageSize_page_keywords": "сүрөттү кысуу, акысыз сүрөт кысуу, сүрөт өлчөмүн азайтуу, тез сүрөт кысуу, онлайн сүрөт кысуу, сүрөт өлчөмүн азайтуу, жоготусуз сүрөт кысуу, сүрөттү оптимизациялоо, PNG кысуу, JPEG кысуу, сүрөт өлчөмүн азайтуу куралы, тез сүрөт кысуу, вебсайттар үчүн сүрөт кысуу, социалдык медиа үчүн сүрөт кысуу, акысыз онлайн сүрөт кысуучу, ыңгайлуу сүрөт кысуу, тез сүрөт оптимизациясы",
    "image_page_keywords": "сүрөттү конвертациялоо, акысыз сүрөт конвертациясы, онлайн сүрөт конвертациясы, сүрөт файлдарын конвертациялоо, сүрөт конвертациялоо куралы, акысыз сүрөт файлдарын конвертациялоо, PNGни JPGге конвертациялоо, JPGни PNGге конвертациялоо, сүрөттү PDFге конвертациялоо, сүрөт форматын өзгөртүү, онлайн сүрөт конвертер, сүрөт файлдарынын форматтарын өзгөртүү, ыңгайлуу сүрөт конвертациясы, акысыз сүрөт конвертациясы, тез сүрөт конвертер, топтом менен сүрөт конвертациясы, онлайн сүрөттү конвертациялоо",
    "colorPicker_page_keywords": "түс тандоочу, акысыз түс тандоо куралы, онлайн түс тандоо, онлайн түстү тандоо, hex түс тандоочу, RGB түс тандоочу, түс кодун жаратуучу, түс палитрасын түзүүчү, түс тандоо куралы, онлайн түс тандоо, түс дөңгөлөгү, түстөрдү тандоо, онлайн түс тандоо куралы, веб-дизайн үчүн түс тандоочу, графикалык дизайн үчүн түс тандоочу, түс палитрасын түзүү, өзгөчөлөнгөн түстөрдү түзүү, акысыз онлайн түс тандоочу",
    "colorMixing_page_keywords": "түстөрдү аралаштыруу, онлайн түстөрдү аралаштыруу, түс аралаштыргычы, түстөрдү айкалыштыруу куралы, өзгөчөлөнгөн түстөрдү түзүү, түстөрдү аралаштыруу куралы, онлайн түстөрдү аралаштыруу, RGB түстөрдү аралаштыруу, түс палитрасын түзүү, дизайн үчүн түстөрдү аралаштыруу, акысыз түстөрдү аралаштыруучу, графикалык дизайн үчүн түстөрдү аралаштыруу, түстөрдүн айкалыштарын жаратуучу, онлайн түстөрдү аралаштыруу куралы, негизги түстөрдү аралаштыруу, түстөрдүн гармониясы, түстөрдү аралаштыруу куралы, веб-дизайн үчүн түстөрдү аралаштыруу",
    "qrCode_page_keywords": "QR кодун түзүү, онлайн QR код түзүү, текст үчүн QR код, шилтеме үчүн QR код, акысыз QR код түзүүчү, вебсайт үчүн QR код түзүүчү, QR код түзүү, QR кодду оңой түзүү, URL үчүн QR код, тексттик билдирүү үчүн QR код, өзгөчө QR код түзүү, бизнес үчүн QR код түзүү, QR код түзүү куралы, QR кодун сканерлөө, тез QR код түзүү, онлайн QR код түзүү, акысыз QR код түзүү",
    "order_website": "Вебсайт түзүү же заказ кылуу",
    "order_website_description": "Өзгөчөлөнгөн вебсайт түзүңүз же даяр шаблонду жана дизайнды сатып алыңыз. Тез жана жеткиликтүү вебсайт иштеп чыгуу кызматтары.",
    "order_website_keywords": "вебсайт түзүү, вебсайт заказ кылуу, вебсайт шаблондорун сатып алуу, веб-дизайн, вебсайт иштеп чыгуу, өзгөчөлөнгөн вебсайт, сайтты долбоорлоо, HTML шаблондору, сайт шаблондору",
    "shortener_page_keywords": "Шилтемени кыскартуу, Ыкчам шилтемени кыскартуу, Онлайн шилтемени кыскартуу, Кыска шилтемелер, Кыска шилтеме генератору, Шилтемени узундугун кыскартуу, Социалдык тармактар үчүн кыска шилтемелер, Кыска URL, Шилтемени кыскартуу куралы, Ыңгайлуу шилтемени кыскартуу, Шилтемени акысыз кыскартуу",
    "passwordGenerator_page_keywords": "пароль генератору, пароль түзүү, коопсуз пароль, онлайн пароль генератору, бекем пароль генератору, сан жана белгилер менен пароль, чоң тамгалар менен пароль, аккаунт үчүн пароль генератору, узун пароль, уникалдуу пароль, коопсуз пароль түзүү",


    "something_went_wrong": "Бир нерсе туура эмес болду",
    "go_back": "Назад"

}
