{
    "translator": "Překladatel",
    "color_picker": "Výběr barvy",
    "converter": "Převodník",
    "qr_code": "QR kód",
    "settings": "Nastavení",
    "service_and_support": "Služby a podpora",
    "help_center": "Centrum nápovědy",
    "order_website": "Objednat web",
    "project_support": "Podpora projektu",
    "others": "Ostatní",
    "partners": "Partneři",
    "reviews": "Recenze",
    "advertising": "Reklama",
    "social_media": "Sociální média",

    "free_online_translator": "Bezplatný online překladač",
    "translate_file": "Přeložit soubor",
    "char_count": "Počet znaků: ",
    "multilingual_translator": "Vícejazyčný překladač",
    "multilingual_description": "Na této stránce můžete zadat text a okamžitě jej přeložit do 10 různých jazyků. Tento nástroj je užitečný pro uživatele, kteří potřebují překlad do několika jazyků současně, aniž by museli překládat pro každý jazyk zvlášť.",
    "placeholder_detect_language": "Detekovat jazyk",
    "placeholder_enter_text": "Zadejte text pro překlad...",

    "recognize_text": "Rozpoznat text v obrázku",
    "translate_text": "Přeložit text",
    "languages_count": "122 jazyků",
    "upload_image": "Nahrát obrázek",
    "supported_formats": "Podporované formáty: obrázky",
    "photo_translator": "Překladač obrázků",
    "photo_description": "Na této stránce můžete nahrát obrázek, který obsahuje text. Naše služba používá technologii OCR (optické rozpoznávání znaků) k extrahování textu z obrázku a jeho překladu do 10 různých jazyků. Je to ideální nástroj pro překlad log, dokumentů nebo reklamních materiálů.",
    "translation_error": "Chyba při překladu.",
    "word_file_error": "Chyba při čtení souboru Word:",
    "language_detection_failed": "Nepodařilo se detekovat jazyk.",
    "ocr_error": "Chyba při rozpoznávání textu v obrázku:",
    "invalid_file_format": "Neplatný formát souboru. Nahrajte soubory DOCX nebo obrázky.",
    "perform_translation_first": "Nejdříve proveďte překlad.",
    "text_copied": "Text byl zkopírován do schránky!",

    "define_pixel_color": "Definujte barvu pixelu v obrázku",
    "color_blending": "Míchání barev",
    "up_to_10_colors": "Až 10 barev",
    "color_picker_result": "Výsledek:",
    "select_color_from_image": "Vyberte barvu z obrázku",
    "color_picker_description": "Na této stránce můžete nahrát obrázek a použít výběr barev k určení jakékoliv barvy z něj. Tento nástroj vám umožní přesně určit hodnotu barvy pomocí HEX a RGB kódů. Ideální pro designéry nebo každého, kdo pracuje s barvami.",

    "color_mixer_tool": "Nástroj pro míchání barev",
    "define_color_by_photo": "Definujte barvu podle fotografie",
    "mixing_result": "Výsledek míchání:",
    "add_color": "Přidat barvu",
    "color_mixing_examples": "Příklady míchání barev",
    "red": "Červená",
    "lime": "Limeta",
    "blue": "Modrá",
    "gray": "Šedá",
    "purple": "Fialová",
    "violet": "Fialová",
    "yellow": "Žlutá",
    "orange": "Oranžová",
    "green": "Zelená",
    "brown": "Hnědá",
    "turquoise": "Tyrkysová",
    "color_mixer": "Míchání barev",
    "color_mixing_description": "Na této stránce můžete míchat různé barvy a vytvářet nové. Nástroj pro míchání barev vám umožňuje přidat více barev a upravit je pro náhled výsledků. Ideální pro designéry, umělce nebo každého, kdo pracuje s barvami.",

    "image_converter": "Převodník obrázků",
    "image_compression": "Komprese obrázků",
    "select_image_for_conversion": "Vyberte obrázek pro převod:",
    "select_output_format": "Vyberte požadovaný formát",
    "converting": "Probíhá převod...",
    "convert": "Převést",
    "converted_file": "Převodný soubor:",
    "download_converted_file": "Stáhnout převedený soubor",
    "image_converters": "Převodníky obrázků",
    "image_converter_description": "Na této stránce můžete převést obrázek z jednoho formátu do jiného. Náš převodník podporuje formáty JPEG, PNG, GIF a další. Ideální pro rychlou konverzi obrázků.",
    "file_too_large": "Soubor je příliš velký. Nahrajte soubor menší než 10 MB.",
    "please_select_file": "Vyberte soubor.",
    "conversion_not_possible": "Převod není možný.",
    "conversion_error": "Chyba při převodu.",

    "select_image_for_compression": "Vyberte obrázek pro kompresi:",
    "original_image": "Původní obrázek:",
    "compressed_image": "Komprimovaný obrázek:",
    "size": "Velikost:",
    "size_after_compression": "Velikost po kompresi:",
    "download_compressed_image": "Stáhnout komprimovaný obrázek",
    "compress_again": "Kompresovat znovu",
    "image_size_reduction": "Snížení velikosti obrázku",
    "image_size_reduction_description": "Tento nástroj vám umožní zmenšit velikost obrázku, aniž by došlo k výrazné ztrátě kvality. Ideální pro optimalizaci obrázků na webových stránkách a zrychlení načítání stránek.",

    "qr_code_generator": "Generátor QR kódů",
    "shorten_link": "Zkrátit odkaz",
    "enter_url": "Zadejte URL:",
    "scan_to_visit": "Naskenujte pro návštěvu:",
    "download_qr_code": "Stáhnout QR kód",
    "qr_code_creation": "Vytvoření QR kódu",
    "qr_code_creation_description": "Na této stránce můžete zadat text nebo odkaz pro vytvoření QR kódu. Generátor QR kódů je ideální nástroj pro vytváření kódů pro vizitky, webové stránky nebo reklamní materiály.",

    "about_us": "O nás",
    "website_description": "Tento web byl vytvořen vývojáři během jednoho týdne. Věnovali jsme veškerý náš čas a úsilí, abychom vytvořili užitečný a všestranný nástroj pro uživatele.",
    "specialist_description": "Specialisté na webové designové řešení, které kombinují kreativitu a funkčnost. Používáme moderní technologie k splnění potřeb našich klientů.",
    "developer_description": "Zkušený vývojář aplikací a interaktivních webů. Specialista na integraci databází a serverovou logiku.",
    "pricing_for_website_development": "Cenové možnosti pro vývoj webových stránek",
    "contact_for_website_development": "Pro konzultaci o vašem projektu a objednávku webových stránek nás kontaktujte prostřednictvím <a href=\"https://t.me/abduvoxit260803\">těchto odkazů</a>.",
    "pricing_for_templates": "Cenové možnosti pro šablony",

    "our_partners": "Naši partneři",

    "multilingual_page_keywords": "vícejazyčný, překladač, překladač do 122 jazyků, bezplatný překladač, překlad několika jazyků, vícejazyčný překlad, online překladač, multitask překladač, přeložit několik jazyků, bezplatný překladač, překlad v reálném čase, vícejazyčné překlady, jazyková podpora, vícejazyčná řešení, vícejazyčný nástroj",
    "photo_page_keywords": "překladač souborů, extrakce textu ze souborů, nahrávání a překlad souborů, překlad textu z obrázků, úprava přeloženého textu, kopírování přeloženého textu, text na řeč, hlasový překlad, překlad textů z dokumentů, OCR překlad textu, bezplatný překladač souborů, vícejazyčný překladač souborů, rozpoznávání textu na obrázcích, extrakce textu z dokumentů, překlad dokumentů, úprava a poslech překladů",
    "imageSize_page_keywords": "komprese obrázků, bezplatná komprese obrázků, zmenšení velikosti obrázků, rychlá komprese obrázků, online komprese obrázků, zmenšení velikosti obrázků, komprese obrázků beze ztráty kvality, optimalizace obrázků, komprese PNG, komprese JPEG, nástroj na zmenšení velikosti obrázků, rychlá komprese obrázků, komprese obrázků pro weby, komprese obrázků pro sociální sítě, bezplatný online kompresor obrázků, snadná komprese obrázků, rychlá optimalizace obrázků",
    "image_page_keywords": "konvertor obrázků, bezplatný konvertor obrázků, konverze obrázků online, konvertování souborů obrázků, nástroj pro konverzi obrázků, bezplatný konvertor souborů obrázků, konverze PNG na JPG, konverze JPG na PNG, konverze obrázků do PDF, konverze formátů obrázků, online konvertor obrázků, změna formátu souborů obrázků, snadná konverze obrázků, konverze obrázků zdarma, rychlý konvertor obrázků, hromadná konverze obrázků, konverze fotek online",
    "colorPicker_page_keywords": "výběr barev, bezplatný nástroj pro výběr barev, online výběr barev, výběr barvy online, výběr barvy v hex formátu, výběr barvy v RGB formátu, generátor barevných kódů, generátor barevných palet, nástroj pro výběr barev, výběr barev online, barevné kolo, výběr barev pro design, online nástroj pro výběr barev, výběr barev pro webový design, výběr barev pro grafický design, vytváření barevných palet, tvorba vlastních barev, bezplatný online výběr barev",
    "colorMixing_page_keywords": "míchání barev, míchání barev online, barevný mixér, nástroj pro kombinování barev, tvorba vlastních barev, nástroj pro míchání barev, míchání barev online, míchání RGB barev, tvorba barevných palet, míchání barev pro design, bezplatný mixér barev, míchání barev pro grafický design, generátor barevných kombinací, online nástroj pro míchání barev, míchání primárních barev, barevná harmonie, nástroj pro míchání barev, míchání barev pro webový design",
    "qrCode_page_keywords": "QR kód generátor, vytvořit QR kód online, QR kód pro text, QR kód pro odkaz, bezplatný generátor QR kódů, generátor QR kódů pro webové stránky, vytvořit QR kód, snadné generování QR kódů, QR kód pro URL, QR kód pro textovou zprávu, vlastní QR kód, vytvořit QR kód pro firmu, nástroj pro vytvoření QR kódu, skenování QR kódu, rychlý generátor QR kódů, online generátor QR kódů, vytvořit QR kódy zdarma",
    "order_website": "Vytvořit nebo objednat web",
    "order_website_description": "Objednejte si vlastní web nebo kupte hotové šablony a rozvržení. Rychlý a cenově dostupný vývoj webových stránek.",
    "order_website_keywords": "vytvořit web, objednat web, koupit šablony webů, web design, vývoj webu, vlastní web, rozvržení webů, HTML šablony, šablony webových stránek",

    "something_went_wrong": "Něco se pokazilo",
    "go_back": "Zpět"

}
